[
  {
    "name": "Allantoin",
    "facts": "Type of ingredient: Moisturizer and exfoliator.\n\nMain benefits: Moisturizes, soothes itchiness, and heals injured skin.\n\nWho should use it: In general, those with dry, itchy skin looking for better skin texture and smoothness, regardless of skin type, age, or conditions.\n\nHow often can you use it: Can be used day in and day out without general side effects of any kind, according to Shamban.\n\nWorks well with: Herrmann says when used in scar creams, allantoin is often combined with ingredients like silicone and other emollients to amplify results.\n\nDon't use with: Herrmann adds that combining it with other exfoliants could produce an exaggerated reaction, causing excess irritation, if strengths are too high."
  },
  {
    "name": "Alcohol Denat",
    "facts": "Type of ingredient: Alcohol.\n\nMain benefits: Alcohol denat is largely used in skincare and cosmetics more for its formulation benefits, rather than having any actual positive effects on the skin. It helps products spread easily and absorb quickly and acts as a preservative, says Cheung. Because it removes oils from the skin, it can also help other ingredients penetrate better, adds Petrillo (though this is precisely what makes it so drying). This is also why it may occasionally be used to de-grease skin and as prep before a chemical peel, Cheung points out.\n\nWho should use it: According to the experts we spoke with, it's generally an ingredient to avoid, though it's a major no-no for those with dry or sensitive skin.\n\nHow often can you use it: It's best not to use it all, but if it's in one of your favorite products, use it sparingly, not more that once every two weeks, warns Johnson.\n\nWorks well with: Many ingredients, hence why it's so commonly used.\n\nDon't use with: Again, you want to be cautious of alcohol denat to begin with, but because it does increase the penetration of other ingredients, be especially wary of products where it's combined with other potential irritants, such as fragrance, notes Gonzalez."
  },
  {
    "name": "Almond Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Reduces irritation, helps with UV damage, reduces stretch marks.\n\nWho should use it: In general, anyone with skin in need of calming and hydration.\n\nHow often can you use it: As often as you would any other oil, so about once or twice a day.\n\nWorks well with: Other oils.\n\nDon't use: If you have a nut allergy."
  },
  {
    "name": "Aloe Vera",
    "facts": "Type of ingredient: Skin soother.\n\nMain benefits: Calms, soothes, and hydrates the skin.\n\nWho should use it: In general, anyone looking to soothe burns, including sunburn and windburn, and moisturize their skin.\n\nHow often can you use it: Nussbaum recommends applying it two to three times daily.\n\nWorks well with: To increase the calming benefits, Nussbaum suggests using it with anti-inflammatory ingredients.\n\nDon't use with: Nussbaum says to avoid using aloe vera products that also contain alcohol, which will negate the moisturizing, soothing effects of the aloe, and also avoid combining it with chemical exfoliants, which could worsen any stinging or irritation. If you have a burn, Nussbaum advises against using it with an ointment or petrolatum, which will trap the heat inside."
  },
  {
    "name": "Alpha-Hydroxy Acids",
    "facts": "Type of ingredient: Acid/chemical exfoliant.\n\nMain benefits: Exfoliates the top layers of skin to minimize dullness and even out texture; some AHAs can also stimulate collagen production, while others have antioxidant and hydrating properties.\n\nWho should use it: Given their wide range of effects, most people can benefit from using AHAs, says Nazarian, so long as you find the right alpha-hydroxy acid and concentration of it for your skin type.\n\nHow often can you use it: This differs greatly based on the particular acid, product, and your skin. Follow product directions, but always start slow, using any AHA only once or twice per week and gradually increasing frequency as your skin can tolerate it, suggests Nussbaum.\n\nWorks well with: Peptides can slow the penetration of AHAs, making them less irritating, says Nussbaum. You can also pair them with hydrating ingredients.\n\nDon't use with: Avoid using retinoids at the same time of day as AHAs, and be cautious when using both BHAs (beta hydroxy acids, such as salicylic acid) and AHAs in order to minimize irritation."
  },
  {
    "name": "Amla Extract",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Hydrates and protects the skin.\n\nWho should use it: All skin types.\n\nHow often can you use it: Safe for everyday use.\n\nWorks well with: Moisturizers and serums.\n\nDon't use it with: Products that should not be combined with Vitamin C, including Retinol and AHAs."
  },
  {
    "name": "Amino Acids",
    "facts": "Type of ingredient: Varying.\n\nMain benefits: Soothe skin, help moisturize, act as antioxidants.\n\nWho should use it: In general, whatever amino acids are added to your skincare will be catered to the function of the product.\n\nHow often can you use it: You can use amino acids as often as you want; they are gentle enough for everyday use.\n\nWorks well with: Pretty much everything; glycerides, ceramides, and peptides in particular.\n\nDon't use with: Amino acids can be mixed with a host of other ingredients."
  },
  {
    "name": "Amoxicillin",
    "facts": "Type of ingredient: Antibiotic.\n\nMain benefits: Most commonly used to treat upper respiratory bacterial infections and urinary tract infections; sometimes used as a second-line treatment for acne.\n\nWho should use it: Those dealing with moderate to severe inflammatory acne, and who can't take the tetracycline class of antibiotics (minocycline, doxycycline) because of allergy or pregnancy.\n\nHow often can you use it: It's usually prescribed twice daily for acne, though as with any antibiotics for acne, it should be discontinued after three to four months of use.\n\nWorks well with: Oral antibiotics are generally paired with topical medications that contain benzoyl peroxide and topical retinoids, says Zeichner.\n\nDon't use with: Other topical antibiotics, which can increase the likelihood of developing bacterial resistance."
  },
  {
    "name": "Apple Cider Vinegar",
    "facts": "Type of ingredient: Exfoliant.\n\nPotential benefits: Balances skin's pH, chemically exfoliates, reduces hyperpigmentation.\n\nWho should use it: In general, people with oily and acne-prone skin.\n\nHow often can you use it: It depends on what product and concentration you're using it in. For a store-bought product, check directions first. If using a DIY diluted ACV solution, two to three times a week is the general recommendation.\n\nWorks well with: Anti-inflammatories.\n\nDon't use with: Other acids or retinoids."
  },
  {
    "name": "Apricot Kernel Oil",
    "facts": "Type of ingredient: Emollient and anti-inflammatory.\n\nMain benefits: Skin barrier support, locks in moisture, and helps improve the appearance of fine lines and wrinkles.\n\nWho should use it: Anyone looking for a moisturizer oil that doesn't have acne-prone skin.\n\nHow often can you use it: It’s safe to use on skin as needed.\n\nWorks well with: Most skincare products."
  },
  {
    "name": "Arbutin",
    "facts": "Type of ingredient: Brightener.\n\nMain benefits: Lightens dark spots, lessens the appearance of acne scars, helps even out skin tone.\n\nWho should use it: Arbutin is generally safe for all skin types.\n\nHow often can you use it: Arbutin can be used twice a day. It is safe to apply on clean skin with other creams and serums. It can also be used in the summer since it does not make skin more sensitive to the sun.\n\nWorks well with: Vitamin C, AHAs.\n\nDon't use with: While there are no known negative interactions with other skincare ingredients, heat can degrade the effectiveness of arbutin."
  },
  {
    "name": "Argan Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Helps protect against environmental damage, offers moisture and nourishment to the skin, and soothes irritated skin.\n\nWho should use it: While particularly beneficial for dry skin, it works well with essentially any skin type; however, proceed with caution if you have an inflammatory skin condition (such as seborrheic dermatitis), as these can be aggravated by external oils, according to Howe. .\n\nHow often can you use it: It can be used once or twice daily.\n\nWorks well with: Argan oil works well layered over cream and other products in a skincare routine, and makes a great final step.\n\nDon't use with: When using products that contain linoleic and oleic acids, pay attention to how your skin reacts and make sure to use them as instructed. ."
  },
  {
    "name": "Argireline",
    "facts": "Type of ingredient: Peptide.\n\nMain benefits: Prevents the muscle movement that leads to wrinkle formation. Argireline also promotes collagen production and optimizes the function of collagen, which both fight fine lines and improve moisture levels in the skin, says Shah.\n\nWho should use it: Anyone looking to smooth out wrinkles caused by repeated muscle movement in areas such as the forehead and around the eyes. It's also a good pick for anyone with dry skin as it helps allocate moisture to the area of application.\n\nHow often can you use it: It can be used daily.\n\nWorks well with: One study suggests that it works well in conjunction with another peptide, tripeptide-10-citrulline, which increases the permeability for Argireline to penetrate to a depth where it can target muscles that cause wrinkles. It's also often combined with hyaluronic acid to up the hydration benefits.\n\nDon't use with: Generally speaking, Argireline works well with all ingredients."
  },
  {
    "name": "Ascorbyl Glucoside",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Neutralizes skin-damaging free radicals, inhibits the production of pigment to fade and prevent dark spots, boosts collagen production.\n\nWho should use it: In general, because this is a less potent version of vitamin C, it's a good option for all skin types and anyone looking to brighten a dull complexion, enhance radiance, and stave off signs of aging such as fine lines and wrinkles, advises Nussbaum.\n\nHow often can you use it: Recommended use is usually once a day, though it can be used twice daily as well.\n\nWorks well with: As an antioxidant, ascorbyl glucoside plays nice with many different ingredients, though it may work especially well with niacinamide, a type of vitamin B. \"When combined, these two ingredients can help address issues such as loss of firmness and elasticity, wrinkles and fine lines, unevenness in the complexion, and large pores,\" explains Solomon. All antioxidants also work well with sunscreen, offering an added layer of protection.\n\nDon't use with: Benzoyl peroxide might oxidize vitamin C and should therefore be avoided. Vitamin C and retinol are active at different pHs and therefore should be used separately if you want the full potential of each ingredient, notes Nussbaum."
  },
  {
    "name": "Astaxanthin",
    "facts": "Type of ingredient:  Carotenoid (yellow, orange, and red pigments that are produced by plants, algae, and bacteria).\n\nMain Benefits: Improves dryness, protects the skin against free radicals and sun damage.\n\nWho Should Use It: It is recommended for those of all ages and skin types and is especially beneficial for those with damaged skin.\n\nHow Often Can You Use It: It is safe to use morning and night.\n\nWorks Well With: Moisturizers.\n\nDon't Use With: Generally, astaxanthin is safe to use with all other ingredients."
  },
  {
    "name": "Avocado Oil",
    "facts": "Type of ingredient: Antioxidant, emollient, and anti-inflammatory.\n\nMain benefits: Helps the skin maintain hydration and minimizes damage from free radicals.\n\nWho should use it: Because of its anti-inflammatory properties, Russak recommends avocado oil for anybody who has eczema, acne, seborrheic dermatitis, or psoriasis.\n\nHow often can you use it: Avocado oil is safe to use daily in a dilute form. If it is included in a product's formulation, follow the manufacturer's instructions.\n\nWorks well with: Russak recommends combining avocado oil with retinol. \"The most absorption of the retinol happens with a fat-soluble content,\" Russak explains. \"Combining it with an oil will increase absorption and decrease the irritation from it.\" Although avocado oil has moisturizing properties, Hayag says it also would be beneficial for maximal moisture to use in combination with a humectant like hyaluronic acid to draw water into the skin.\n\nDon't use with: There are no ingredients that contraindicate with avocado oil, but Russak suggests refraining from using the oil with other oils, such as vitamin K. \"You're just creating too much of the lipids on the surface of the skin, and lipids start competing in terms of how they penetrate the skin, so it will decrease the efficacy of whatever you're trying to do,\" Russak explains."
  },
  {
    "name": "Azelaic Acid",
    "facts": "Type of ingredient: Acid/Exfoliant.\n\nMain benefits: Fights acne, treats rosacea, lightens dark spots, and removes dead skin cells.\n\nWho should use it: In general, anyone with acne-prone, rosacea-prone skin, and hyperpigmentation. Fusco says azelaic acid is recommended for all skin types and is even safe for those who are pregnant.\n\nHow often can you use it: It is safe to use twice a day (morning and night) or once every other day for those with sensitive skin.\n\nWorks well with: Alpha-hydroxy acids (AHA), beta-hydroxy acid (BHA), and retinol.\n\nDon't use with: Azelaic acid is safe to use in conjunction with most, if not all, ingredients."
  },
  {
    "name": "Azulene Oil",
    "facts": "Type of ingredient: Botanical oil.\n\nMain benefits: Azulene oil soothes and reduces redness and inflammation. It's also moisturizing and enhances skin barrier function, and has some antibacterial properties.\n\nWho should use it: Azulene oil is great for sensitive skin types, as it's both non-irritating and calming. It also helps dry and aging skin retain moisture, says Cheung.\n\nHow often can you use it: It can be applied daily.\n\nWorks well with: Other commonly used skin-soothers, such as aloe and vitamin E, Chimento tells us. Johnson adds that it's often found in many of the products meant to be used post-hair removal, as it's usually combined with mint extract, which delivers a cooling effect that pairs nicely with azulene's benefits.\n\nDon't use with: While it plays well with most ingredients, be cautious about products where it's mixed with multiple essential oils, as this increases the likelihood of an allergic reaction; many people are allergic to these oils, says Johnson."
  },
  {
    "name": "Baking Soda",
    "facts": "Type of ingredient: Exfoliant.\n\nPotential benefits: Exfoliates, offers anti-inflammatory properties, and may help balance out the pH for those with oilier skin.\n\nWho should use it: Only those who are in a pinch and don't have access to products that use ingredients specifically formulated to fight acne, such as salicylic acid and benzoyl peroxide, cautions Nussbaum. Generally speaking, it's also a better option for oilier skin types, adds Gonzalez, but it can be problematic even then.\n\nHow often can you use it: No more than once per week.\n\nWorks well with: Mix it only with water to create a spot treatment.\n\nDon't use with: Because baking soda may be very drying, don't use it with other potentially drying skincare ingredients, such as retinoids or acids."
  },
  {
    "name": "Bakuchiol",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Wrinkle reduction, increases skin firmness, and reduces the appearance of pores.\n\nWho should use it: Generally, bakuchiol is safe for all skin types.\n\nHow often can you use it: It's safe to use twice a day, in the morning before moisturizer and at night before any serums.\n\nWorks well with: Other hydrating ingredients, like squalane and PHAs.\n\nDon't use with: Glycolic acid might degrade the formulation."
  },
  {
    "name": "Baobab",
    "facts": "Type of ingredient: Hydrator. \n\nMain benefits: Moisturizes, soothes skin, heals dry cuticles and hair.\n\nWho should use it: Anyone suffering from dry or sensitive skin.\n\nHow often can you use it: Baobab is gentle enough to use every day.\n\nWorks well with: Baobab can be used in conjunction with other oils, on its own or mixed with masks or moisturizers.\n\nDon't use with: Generally, baobab is safe to use with all other ingredients."
  },
  {
    "name": "Bentonite Clay",
    "facts": "Type of ingredient: Mineral-rich clay.\n\nMain benefits: Absorbs excess oil, exfoliates, offers anti-inflammatory properties.\n\nWho should use it: Those with oily or acne-prone skin may find bentonite clay to be especially beneficial, though it can be too drying for those with dry or sensitive skin, says Fahs.\n\nHow often can you use it: This depends on the product you're using and your particular skin type, though usually weekly.\n\nWorks well with: Jeffy says it can be used with a variety of different ingredients--including tea tree oil, apple cider vinegar, and turmeric, just to name a few--for synergistic effects.\n\nDon't use with: Since it can be drying in and of itself, be cautious about pairing it with other acne-fighting ingredients, such as acids or retinols, says Fahs."
  },
  {
    "name": "Benzoyl Peroxide",
    "facts": "Type of ingredient: Anti-bacterial.\n\nMain benefits: Reduces acne-causing bacteria.\n\nWho should use it: In general, benzoyl peroxide is suitable for those looking to treat mild to moderate acne at home.\n\nHow often can you use it: Benzoyl peroxide shouldn't be used more than twice per day, at most.\n\nWorks well with: Benzoyl peroxide works well in combination with salicyclic acid to treat acne.\n\nDon't use with: Don't use multiple benzoyl peroxide products at once. Benzoyl peroxide may also reduce the efficacy of vitamin C products when used as part of the same routine."
  },
  {
    "name": "Benzyl Alcohol",
    "facts": "Type of ingredient: Preservative, antioxidant, and solvent.\n\nMain benefits: Preserves, stabilizes, and dissolves ingredients.\n\nWho should use it: In general, benzyl alcohol is safe to use by anyone who does not have a true contact allergy to it. Krant adds that those who prefer un-preserved products would want to avoid products containing standard preservatives like benzyl alcohol, though it may risk contamination.\n\nHow often can you use it: Benzyl alcohol is safe to use daily if you're not sensitive to it and if it's used at a low concentration.\n\nWorks well with: Benzyl alcohol works well with most, if not all, other ingredients.\n\nDon't use with: Benzyl alcohol works well with most, if not all, other ingredients."
  },
  {
    "name": "Beta-Glucan",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Boosts skin barrier, smooths skin, antioxidant.\n\nWho should use it: In general, people with compromised skin barriers, but anyone can use them.\n\nHow often can you use it: You can use it as often as you would like.\n\nWorks well with: Retinols, or anything else dehydrating or irritating. Sunscreens, as it helps reduce issues related to UV exposure.\n\nDon't use with: When used topically, beta-glucans aren't known to interfere with other ingredients (when taken as a supplement, however, experts caution against taking beta-glucans with immunosuppressants, so talk to your doctor first)."
  },
  {
    "name": "Bhringraj Oil",
    "facts": "Type of ingredient: an antioxidant-rich oil  .\n\nMain benefits: promotes hair growth; softens, strengthens, and adds shine to hair; prevents greying and hair loss.\n\nWho should use it: In general, bhringraj oil is probably best utilized for scalp and hair issues such as dry, itchy scalp from dandruff, eczema, or psoriasis. It can also be used by anyone with a history of hair loss, shedding, or graying.\n\nHow often can you use it: It is safe to use in scalp massages up to twice a week.\n\nWorks well with: Carrier oils like amla and coconut.\n\nDon't use with: There are no known products that should be avoided while using bhringraj oil. ."
  },
  {
    "name": "Biotin",
    "facts": "Type of ingredient: B complex vitamin.\n\nMain benefits: Contributes to overall skin health.\n\nWho should use it: According to Jaliman, anyone deficient in biotin can take the supplement.\n\nHow often can you use it: Garshick says the general dose of a biotin supplement used is 2.5 to 3 mg (2500 to 3000 mcg) a day, but it hasn't been extensively studied, so it is still unknown what the best optimal dosing is. However, Jaliman says a supplement is safe for daily use for most but advises people to follow the directions on the specific product they purchase. Because it depends on the micrograms, Jaliman suggests checking the label to decide how often it should be taken.\n\nWorks well with: Jaliman recommends combining biotin with protein supplements. \"Protein helps the body to produce keratin, which is vital to the hair structure and also skin and nails,\" Jaliman explains. She also recommends taking collagen in conjunction with a biotin supplement. \"Collagen is found in the layer of the skin that gives the skin its fullness and plumpness,\" she adds.\n\nDon't use with: Garshick says some antibiotics and anti-seizure medications can affect the absorption of biotin, so it is always best to discuss with your doctor prior to starting a biotin supplement (or any supplement, in general)."
  },
  {
    "name": "Black Cumin Seed Oil",
    "facts": "Type of ingredient: Antioxidant, anti-inflammatory.\n\nMain benefits: Diminishes fine lines, fights acne, unclogs pores, fades dark spots.\n\nWho should use it: In general, black cumin seed oil is great for all skin types.\n\nHow often can you use it: It's safe to use up to two times a day, morning and night.\n\nWorks well with: Black cumin seed oil can be combined with many other ingredients and is often combined with other emollients, oils, and/or moisturizing ingredients such as shea butter, ceramides, beeswax, and hyaluronic acid.\n\nDon't use with: In general, black cumin seed oil can be used with most, if not all, ingredients."
  },
  {
    "name": "Borage Seed Oil",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Has hydrating, anti-inflammatory, antioxidant properties, and improves health of the skin barrier by improving wound healing and reducing skin infections .\n\nWho should use it: Borage seed oil is best for dry skin and inflammatory skin conditions including eczema, acne, rosacea, and seborrheic dermatitis. .\n\nHow often can you use it: Borage seed oil is typically used once or twice daily. .\n\nWorks well with: Borage seed oil combines well with carrier oils when the carrier oil is applied first. .\n\nDon't use with: Non-steroidal anti-inflammatory drugs (NSAIDs) can inactivate borage seed oil."
  },
  {
    "name": "Butylene Glycol",
    "facts": "Type of ingredient: Humectant, solvent, and emollient.\n\nMain benefits: Retains moisture, dissolves ingredients, and improves application.\n\nWho should use it: In general, anyone looking for a way to effectively moisturize their skin.\n\nHow often can you use it: Butylene glycol is safe for daily use for those who do not have an allergy to it or very sensitive skin.\n\nWorks well with: As a solvent, butylene glycol works well with ingredients that are not water-soluble and are difficult to dissolve.\n\nDon't use with: Butylene glycol works well with most, if not all, ingredients."
  },
  {
    "name": "CBD Oil",
    "facts": "Type of ingredient: Antioxidant, anti-inflammatory, sebum-regulating.\n\nMain benefits: Reduces inflammation, healing and calming, regulates oil production, neutralizes free radicals.\n\nWho should use it: It is recommended for those looking to treat mild to moderate inflammatory acne lesions at home. It's also great for sensitive or those allergic to typical anti-acne ingredients, such as benzoyl peroxide or retinol.\n\nHow often can you use it: Products containing CBD oil can be used twice per day as part of your usual anti-acne skincare routine.\n\nWorks well with: Ingredients designed to calm skin and decrease inflammation, including arnica, hyaluronic acid and ceramides.\n\nDon't use with: Ingredients that can counteract the anti-inflammatory benefits of CBD, such as alcohol. Also, be aware that CBD is still an unregulated ingredient, and ongoing research is still exploring CBD's pathways and other ingredients it may or may not work well with."
  },
  {
    "name": "CBD for Skin",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Reduces inflammation, Regulates oil production, Neutralizes free radical damage.\n\nWho should use it: It is recommended for those with inflamed, compromised skin as well as sensitive and dry skin types. It can also benefit those with aging skin.\n\nHow often can you use it: CBD skincare can be used daily.\n\nWorks well with: Actives that calm and nourish the skin barrier, such as ceramides, hyaluronic acid, peptides, and niacinamides.\n\nDon't use with: Be cautious with CBD skincare. Since it is an unregulated industry, it is undetermined what actives it deactivates. It is not recommended to use CBD skin products that contain alcohol, as this might combat its beneficial effects and heighten inflammatory skin conditions."
  },
  {
    "name": "Caffeine",
    "facts": "Type of ingredient: Anti-inflammatory.\n\nMain benefits: Reduces wrinkles, brightens skin, gets rid of inflammation.\n\nWho should use it: In general, people with concerns about wrinkles or aging.\n\nHow often is typical use?: Usually, it's used once a day, in the mornings.\n\nWorks well with: Vitamin C and ginseng for an ultra-brightening effect.\n\nDoesn't work with: N/A."
  },
  {
    "name": "Calamine Lotion",
    "facts": "Type of ingredient: Anti-itch medication and astringent.\n\nMain benefits: Heals the itchiness and discomfort that comes with minor skin conditions like bug bites, sunburn, and poison ivy.\n\nWho should use it: Anyone looking to soothe minor skin conditions.\n\nHow often can you use it: Apply to affected areas every six to eight hours as needed.\n\nWorks well with: For best results, calamine lotion should be used on its own.\n\nDon't use with: No drug interactions have been established with calamine and zinc oxide lotion."
  },
  {
    "name": "Camellia Oleifera Leaf Extract",
    "facts": "Type of ingredient: Plant extract.\n\nMain benefits: Potentially provides antioxidant, anti-inflammatory, and antimicrobial effects on the skin.\n\nWho should use it: Unless you have an allergy, Camellia oleifera leaf extract is generally suitable for most skin types.\n\nHow often can you use it: This depends on the product at hand and the manufacturer's instructions, but Plescia says Camellia oleifera leaf extract is generally safe to use in beauty products in any skin area.\n\nWorks well with: Plescia recommends using additional antioxidants, such as vitamin C, in conjunction with Camellia oleifera leaf extract, which could boost the potential skin benefits, such as reducing the signs of aging, including sun spots, fine lines, and wrinkles.\n\nDon't use with: Plesica says it's safe to use in beauty products in any type of formula and can be used in conjunction with many cosmetic ingredients. ."
  },
  {
    "name": "Capric Triglyceride",
    "facts": "Type of ingredient: Fatty acid and emollient.\n\nMain benefits: It's most often used for formulation purposes as an excellent emulsifier and dispersing agent, notes Rodney. However, it also helps hydrate the skin and is an antioxidant.\n\nWho should use it: It's safe for almost all people to use, except those with a coconut allergy, says Rodney.\n\nWhen you can use it: It's safe to use morning or night.\n\nWorks well with: Fat-soluble vitamins such as A, E, D, and K, though it plays nicely with most ingredients, hence its appearance in so many different formulas.\n\nDon't use with: According to Hu, capric triglyceride doesn't react negatively with any specific ingredients."
  },
  {
    "name": "Caprylyl Glycol",
    "facts": "Type of ingredient: Moisturizer.\n\nMain benefits: Attracts water to and holds it in the skin, but also has preservative-like properties that can help prevent other ingredients from spoiling and extend the shelf life of the product, says Palep. It also helps products spread and absorb more easily into skin, says Belkin.\n\nWho should use it: Generally speaking, it works well for all skin types, especially those looking to keep their skin smooth and moisturized.\n\nHow often you can use it: This is largely dependent on the product within your regimen that contains caprylyl glycol in the formula, says Solomon. Generally speaking, moisturizers and lotions can be used throughout the day, but in case there's another active ingredient in there that may cause irritation with multiple uses, the safest thing is to follow particular product instructions.\n\nWorks well with: It is often used with other ingredients known to hydrate the skin, such as honey, aloe, and hyaluronic acid, says Solomon.\n\nDon't use with: As a rule, it can be used with most other ingredients."
  },
  {
    "name": "Carbomers",
    "facts": "Type of ingredient: Polymer.\n\nMain benefits: Thickening agent, suspends solids in liquids, and works as an emulsifier to prevent oil and water from separating.\n\nHow often can you use it: This will depend on the specific product you are using, but carbomers are known to be safe and do not bioaccumulate, so overuse of this specific product won't be an issue for most.\n\nWorks well with: Carbomers don't specifically work well with or against any other ingredients.\n\nDon't use with: Carbomers are very versatile and work well with just about any ingredient."
  },
  {
    "name": "Caviar Extract",
    "facts": "Type of ingredient: Anti-aging moisturizing agent.\n\nMain benefits: Improves overall skin texture, protects against UV rays, prevents breakdown of elastin, boosts collagen production, reduces inflammation.\n\nWho should use it: People with dry and/or mature skin.\n\nHow often can you use it: Daily. While caviar-infused creams can be used day and night, Green recommends using masks and exfoliants containing the ingredient more sparingly, ideally only one to two times per week.\n\nWorks well with: Fellow softening and hydrating ingredients, along with antioxidant-rich ingredients. \"When combined with antioxidant ingredients, caviar can boost the function of mitochondria in skin cells,\" Green says. \"This helps enable products containing caviar extract to firm, lift, and tighten skin and is the reason it is a great anti-aging ingredient to be used on mature skin.\".\n\nDon't use with: Fish and/or shellfish allergies. Even topically, caviar could potentially cause a reaction. ."
  },
  {
    "name": "Carrot",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Increases cell turnover, brightens skin, reduces inflammation.\n\nWho should use it: In general, anyone concerned about their skin becoming dull. However, people with sensitive skin may want to avoid it.\n\nHow often can you use it?: You can use it in the AM and PM, but no more than twice a day.\n\nWorks well with: Hydrators like hyaluronic acid, non-retinol exfoliants, Vitamin E.\n\nDon't use with: Retinols, which may be too irritating."
  },
  {
    "name": "Castor Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Hydrating, soothing, detoxifying.\n\nWho should use it: In general, people with problematic skin or people who want to prevent wrinkles. Pregnant women should avoid castor oil as it is used to induce labor.\n\nHow often can you use it: Once a week.\n\nWorks well with: Other oils like almond and jojoba.\n\nDon't use with: Any other possible irritants."
  },
  {
    "name": "Cephalexin",
    "facts": "Type of ingredient: Antibiotic.\n\nMain benefits: Typically used to treat a variety of bacterial infections, including bacterial skin infections and infected post-operative wounds.\n\nWho should use it: According to Dhingra, cephalexin is occasionally used for acne flares for patients unable to tolerate tetra-, mino-, and doxycycline (the common antibiotics for moderate-to-severe inflammatory acne). Cephalexin also might be a good option for women planning to become pregnant or currently pregnant but experiencing moderate-to-severe acne flares and can't use traditional acne treatments.\n\nHow often can you use it: Cephalexin should be taken as advised by your doctor, but Baxt says for acne, it would likely be prescribed twice daily for two to four weeks. Black adds, \"long-term antibiotic use can be avoided by using other, often more effective treatment modalities.\".\n\nWorks well with: Since very few oral medications are ideal as a monotherapy, Dhingra stresses the importance of continuing a topical regimen prescribed by your dermatologist.\n\nDon't use with: Ali says when taking cephalexin, alcohol should be avoided; otherwise, there are no restrictions."
  },
  {
    "name": "Ceramides",
    "facts": "Type of ingredient: Moisturizer.\n\nMain benefits: Rebuild and restore the protective barrier of the skin to retain moisture, improve visible signs of aging, and block environmental damage.\n\nWho should use it: In general, anyone with dry skin or anyone interested in anti-aging skincare.\n\nHow often can you use it: It's safe for frequent use and is recommended to be applied twice daily. .\n\nWorks well with: Cholesterol and fatty acids. \"There are three big classes of lipids: ceramides, cholesterol, and fatty acids,\" Levin says. \"There are certain ingredients that work better when they're paired with ceramides, and that's really that trifecta of your natural skin barrier. We always say 1:2:1 (one cholesterol, two ceramides, and one fatty acid), which is the ratio of these lipids for the natural skin barrier.\".\n\nDon't use with: Ceramides are safe to use in conjunction with most, if not all ingredients."
  },
  {
    "name": "Cetearyl Alcohol",
    "facts": "Type of ingredient: Emulsifier.\n\nMain benefits: Stabilizes products, prevents separation, and thickens.\n\nWho should use it: In general, anyone who doesn't have an allergy can safely use cetearyl alcohol.\n\nHow often can you use it: Daily.\n\nWorks well with: Most other emulsifiers.\n\nDon't use with: Cetearyl alcohol is safe to use with most other ingredients, but it can be comedogenic when used in conjunction with ceteareth-20, according to Fusco."
  },
  {
    "name": "Chamomile",
    "facts": "Type of ingredient: Antioxidant, moisturizer, soother.\n\nMain benefit: Calms the skin.\n\nWho should use it: All skin types can use it but sensitive skin types are likely to benefit most since chamomile extract soothes the skin.\n\nHow often can you use it: Chamomile can be used every day.\n\nWorks well with: Compatible with water-based skincare products such as essences, toners, and serums.\n\nDon't use with: There aren't any ingredients that are known to clash with chamomile."
  },
  {
    "name": "Charcoal",
    "facts": "Type of ingredient: Adsorbent.\n\nMain benefit: Removes toxins.\n\nWho should use it: Theoretically, charcoal can remove excess oil, so those with oily skin would benefit the most from trying a charcoal-based skincare product.\n\nHow often can you use it: Because there are no proven benefits when used in skincare, Wong says there is no information on how often charcoal should be used on the skin. However, Levin adds that charcoal is inert and does not cause allergic reactions or irritation.\n\nWorks well with: Clays, which can absorb oil from the skin.\n\nDon't use with: Because charcoal adsorbs (binds to) other substances to remove them, Wong says it's a good idea to avoid using actives with the ingredient but adds that they can be used after the charcoal has been rinsed off."
  },
  {
    "name": "Chia Seed Oil",
    "facts": "Type of ingredient: Non-fragrant plant oil.\n\nMain benefits: Moisturizes, protects from free-radical damage, and improves dryness and itchiness.\n\nWho should use it: Mudgil says thanks to its versatility, chia seed oil, in general, offers benefits for all skin types. Russak adds that anyone with sensitive, inflamed, and dehydrated skin would particularly benefit from chia seed oil in their routine, and it even works well for irritated and oil-prone skin.\n\nHow often can you use it: According to Mudgil, chia seed oil is generally safe to use on a daily basis but stresses the importance of listening to your skin and adjusting accordingly.\n\nWorks well with: Even though chia seed oil is high in antioxidants, Plescia points out that it lacks a high vitamin C concentration, so using vitamin C in conjunction with chia seed oil could boost its skin benefits, which includes reducing signs of aging. Plescia adds that astaxanthin, an ingredient that's high in vitamin C and E, can especially enhance the effectiveness of chia seed oil.\n\nDon't use with: Plescia says chia seed oil can be used in conjunction with many cosmetic ingredients.  ."
  },
  {
    "name": "Citric Acid",
    "facts": "Type of ingredient: Alpha-hydroxy acid.\n\nMain benefits: Promotes exfoliation and skin cell turnover and is also a good source of antioxidants.\n\nWho should use it: Citric acid is generally considered safe for all skin types, except for those with known allergies or especially sensitive skin, says Frieling. However, it can be particularly beneficial for those with oily skin.\n\nHow often can you use it: This is largely dependent upon the particular product you're using, but generally speaking, about two to three times per week.\n\nWorks well with: It's often paired with other alpha-hydroxy acids and beta-hydroxy acids, though this can potentially cause more irritation for those with sensitive skin.\n\nDon't use with: Avoid using citric acid at the same time as any retinoid, as this can lead to irritation and redness, says Rodney. If you want to use them both in one day, use the citric acid in the morning and the retinoid at night, she adds."
  },
  {
    "name": "Cocamidopropyl Betaine",
    "facts": "Type of ingredient: Cocamidopropyl betaine is a surfactant, which means it binds to dirt and grime, works into a lather, and cleanses your skin or hair. .\n\nMain benefits: It lathers easily and leaves the skin feeling hydrated due to the fact that it's derived from coconuts. .\n\nHow often to use it: Hu confirms that you can, and probably already do, use cocamidopropyl betaine daily because it's so common in cleansers, including face and body washes as well as shampoos. .\n\nWorks well with: It works well when paired with other ingredients and is a great hydrating body and face cleanser. .\n\nDon't use with: While CAPB can be safely paired with other ingredients, keep it to a minimum if you're acne-prone, as washing your face too much can result in your skin over-producing sebum."
  },
  {
    "name": "Cocoa Butter",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Heals chapped skin, moisturizes, anti-aging.\n\nWho should use it: In general, anyone in need of a body moisturizer--however, if you easily get body acne, you might want to skip this one.\n\nHow often you can use it: As much as you want.\n\nWorks well with: Vitamin E oil, shea butter.\n\nDoesn't work with: Other potentially pore-clogging ingredients."
  },
  {
    "name": "Coconut Oil",
    "facts": "Type of ingredient: Oil/emollient.\n\nMain benefits: It's occlusive, so it sits on top of the skin, trapping moisture underneath. This helps smooth the skin and lock in existing moisture (however, it does not \"hydrate\" the skin, contrary to popular belief).\n\nWho should use it: Anyone whose skin is not prone to acne or congestion.\n\nHow often you can use it: Use as a nightly makeup remover or massage onto your body after a shower as the pores on your body are less prone to congestion.\n\nWorks well with: Coconut oil should be used on its own.\n\nDon't use it with: There are no known negative reactions with coconut oil."
  },
  {
    "name": "Collagen",
    "facts": "Type of ingredient: Protein.\n\nMain benefits: Moisturizes the skin.\n\nWho should use it: Graf says in general, anyone interested in moisturization and anti-aging can use collagen skincare.\n\nHow often can you use it: Graf says topical collagen, as well as oral collagen, can be used on a daily basis. When applied to the skin, collagen can be used be morning or night or both as it's not sun-sensitizing.\n\nWorks well with: If your ultimate goal of using collagen skincare is to stimulate collagen production, Hayag recommends adding to your routine a retinoid or retinol (which she calls the gold standard for boosting collagen) or peptides and growth factors as a less irritating option that can help by acting as \"messengers\" to signal cells to create collagen. Hayag also recommends vitamin C (another collagen producer) and sunscreen with UVA protection to prevent your collagen from breaking down further.\n\nDon't use with: In general, collagen is safe to use with most ingredients and topical products. \"When you apply hydrolyzed collagen, it gets right into the skin and penetrates rapidly,\" Graf explains, and for that reason, she says it shouldn't interfere with any other product or ingredient."
  },
  {
    "name": "Colloidal Oatmeal",
    "facts": "Type of ingredient: Skin protectant.\n\nMain benefits: Protects, prevents water loss, and soothes the skin.\n\nHow often can you use it: The recommended use for colloidal oatmeal is twice daily.\n\nWorks well with: Colloidal oatmeal can be used in conjunction with ingredients that can be irritating to the skin, such as alpha- and beta-hydroxy acids and retinoids, to help minimize irritation and disruption of the skin barrier.\n\nDon't use with: Colloidal oatmeal works well with most, if not all, other ingredients."
  },
  {
    "name": "Copper Peptides",
    "facts": "Type of ingredient: Retexturizer.\n\nMain benefits: Antioxidant, stimulates collagen production.\n\nWho should use it: In general, anyone looking to get rid of hyperpigmentation.\n\nHow often can you use it: Twice a day.\n\nWorks well with: Copper peptides don't have an enhanced performance when used simultaneously with any particular ingredient, but in general, it's recommended that they are used in conjunction with a barrier-protecting moisturizer.\n\nDoesn't work with: Dermatologists typically recommend that you don't use copper peptides simultaneously with vitamin C, but each case is different depending on the formulas you're using. Consult a dermatologist before using."
  },
  {
    "name": "CoQ10",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Evens skin tone, reduces sun damage, improves skin hydration.\n\nWho should use it: Generally, CoQ10 is safe for most everyone to use. However, those with vitiligo should consult their dermatologist before use.\n\nHow often you can use it: CoQ10 can be used during your morning and night skincare routines. Apply it before you apply any heavy moisturizers.\n\nWorks well with: Aloe vera, vitamin C, vitamin B3, hyaluronic acid.\n\nDon't use with: No known interactions."
  },
  {
    "name": "Cyclopentasiloxane",
    "facts": "Type of ingredient: Emollient, lubricant, and solvent.\n\nMain benefits: Gives products a silky texture, seals hydration, and dissolves heavier ingredients.\n\nWho should use it: In general, anyone looking to soften their skin with a lightweight product.\n\nHow often can you use it: Cyclopentasiloxane is safe to use on a daily basis.\n\nWorks well with: Robinson says it works well when combined with heavier oils or silicones because it makes them easier to spread on the skin.\n\nDon't use with: Cyclopentasiloxane works well with most, if not, all other ingredients."
  },
  {
    "name": "Cypress Oil",
    "facts": "Type of ingredient: Essential oil.\n\nMain benefits: Has antibacterial, antifungal, and antiviral properties and is also an astringent.\n\nWho should use it: Cypress oil is an especially good choice for those with oily skin.\n\nHow often can you use it: Daily, but it must be diluted.\n\nWorks well with: Combines well with other oils and oil-based products; it also works well when paired with hydrating and anti-inflammatory ingredients to balance its astringent function, says Dr. Chimento.\n\nDon't use with: Since it can be drying, it's best not to pair it with alcohol-based products. It may also be too irritating if you're using retinol on a daily basis, notes Dr. Chimento."
  },
  {
    "name": "Zinc Oxide",
    "facts": "Type of ingredient: A mineral that acts as an anti-inflammatory and skin protectant.\n\nMain benefits: Reduces skin irritation and repairs the skin barrier.\n\nWho should use it: While zinc oxide in and of itself can be beneficial for blemishes, none of the dermatologists we spoke with recommend using diaper cream as an acne treatment.\n\nHow often can you use it: If you really do want to try it, use diaper cream only as a spot treatment (not on your full face) overnight, for no more than two to three nights in a row.\n\nWorks well with: In diaper creams, zinc oxide is often paired with occlusive ingredients, such as petroleum, to help seal the skin, says Nussbaum. (Although this is exactly what can be problematic when it comes to using diaper cream for acne--more on that to come).\n\nDon't use with: If you're using diaper cream as a spot treatment, be cautious not to use any harsh acids beforehand, as the occlusive nature can increase the acidic strength and cause irritation, cautions Greenfield."
  },
  {
    "name": "Dihydroxyacetone",
    "facts": "Type of ingredient: A sugar.\n\nMain benefits: Causes a chemical reaction in the skin that creates a darkening of the cells for a tanned look.\n\nWho should use it: Anyone who wants the look of a tan without the sun damage. DHA is generally well-tolerated by most, though it can sometimes cause contact dermatitis, says Farber.\n\nHow often can you use it: The darkening effect of DHA develops within 24 hours and lasts up to a week, on average.\n\nWorks well with: Many hydrating ingredients, which are often combined with DHA in self-tanning products, particularly moisturizers and serums, says Farber.\n\nDon't use with: Alpha hydroxy acids speed up the breakdown of DHA; while they're a good way to remove your tan once you're ready, don't use them when applying self-tanner."
  },
  {
    "name": "Dimethicone",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Gives a silky texture to products, seals hydration, and protects the skin.\n\nWho should use it: It's safe for all ages and recommended for those who want to prevent dry, rough, scaly skin.\n\nHow often can you use it: Daily.\n\nWorks well with: Humectants and active ingredients that cause dryness and irritation.\n\nDon't use with: Dimethicone works well with most, if not all, other ingredients."
  },
  {
    "name": "Doxycycline",
    "facts": "Type of ingredient: Anti-inflammatory.\n\nMain benefits: Commonly used for bacterial infections and treatment of moderate to severe acne.\n\nWho should use it: Those dealing with inflammatory acne on larger areas of the body.\n\nHow often can you use it: Varies from patient to patient.\n\nWorks well with: Oral doxy can be combined with a product that contains benzoyl peroxide but consult a doctor first before use.\n\nDon't use with: N/A."
  },
  {
    "name": "Emollients",
    "facts": "Type of ingredient: Moisturizing agent.\n\nMain benefits: Smoothes and softens the skin by helping to repair cracks in the skin barrier, thus preventing water loss; acts as a lubricating agent in products.\n\nHow often can you use it: Emollients can generally be used regularly and liberally on most types, the one exception being those with naturally very oily skin.\n\nWorks well with: \"Emollients work well with a range of other skincare ingredients,\" says Nussbaum. In moisturizers, emollients work best when paired with other moisturizing agents that have occlusive or humectant properties, meaning they coat and cover the skin or attract water to it, respectively, she explains. They can also be combined with other actives, such as anti-inflammatory botanical extracts.\n\nDon't use with: Avoid pairing emollients with ingredients that can have potentially irritating side effects that you don't want sealed into the skin, cautions Nussbaum, who cites retinol and alpha- and beta-hydroxy acids as common examples."
  },
  {
    "name": "Emu Oil",
    "facts": "Type of ingredient: Oil.\n\nMain benefits: Helps prevent water loss from the skin, increasing hydration.\n\nWho should use it: Emu oil is safe for all skin types, but is most beneficial to individuals with dry, inflamed skin, according to King.\n\nHow often can you use it: As often as necessary.\n\nWorks well with: Other oils and moisturizers.\n\nDon't use with: No serious adverse reactions have been reported with the use of emu oil."
  },
  {
    "name": "Epsom Salt",
    "facts": "Type of ingredient: Epsom salts are composed of magnesium sulfate, a mineral.\n\nMain benefits: Magnesium sulfate can help reduce inflammation and help with skin detoxification, says Henry.\n\nWho should use it:  Avoid using Epsom salts as a breakout treatment if you have sensitive skin. Our experts were mixed on whether or not they should even be used for blemishes to begin with, but more on that to come.\n\nHow often can you use it: Two to three times weekly.\n\nWorks well with: Because they can be drying, Epsom salts pair well mixed with more hydrating ingredients (like hyaluronic acid), says Chimento.\n\nDon't use with: On a related note, avoid using any other ingredients that can be drying--acne-fighters such as salicylic acid or benzoyl peroxide, retinoids, acids--at the same time, cautions Henry."
  },
  {
    "name": "Eucalyptus Oil",
    "facts": "Type of ingredient: Essential oil.\n\nMain benefits: It has antimicrobial, antioxidant, and anti-inflammatory properties, though Chang says more studies are needed to confirm these skin benefits.\n\nWho should use it: Neither Chang nor Robinson recommends eucalyptus oil for dermatologic applications.\n\nHow often can you use it: Eucalyptus oil can be inhaled as needed to ease cold symptoms or relax the muscles, but neither dermatologist recommends the use of eucalyptus oil for dermatologic applications.\n\nWorks well with: Like most essential oils, eucalyptus oil should always be diluted in a carrier solution, such as a fatty oil, before use.\n\nDon't use with: Inform your doctor of any medications you're taking or products you're using before trying eucalyptus oil."
  },
  {
    "name": "Evening Primrose Oil",
    "facts": "Type of ingredient: Plant-based oil.\n\nMain benefits: Moisturizes and softens the skin, and has anti-inflammatory properties that can make it a good choice for those with conditions such as eczema, says Farhang.\n\nWho should use it: Anyone with dry, irritated, or inflamed skin.\n\nHow often can you use it: Daily.\n\nWorks well with: Evening primrose oil works well with other plant-based oils, as well as in oil formulations that contain potentially irritating ingredients such as retinol, says Koestline.\n\nDon't use with: According to the experts we spoke with, there are no ingredients known to interact negatively with evening primrose oil."
  },
  {
    "name": "Ferulic Acid",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Decreases formation of fine lines and wrinkles, brown spots, and other signs of premature aging.\n\nWho should use it: In general, anyone interested in an anti-aging skin regimen. Everyone can benefit from using an antioxidant to protect themselves from free-radical damage, but they can cause possible irritation, so not all antioxidants are the right concoction for each skin type.\n\nHow often can you use it: It's safe to use every day. Apply it in the morning to clean, dry skin before your moisturizer and sunscreen.\n\nWorks well with: Other antioxidants, particularly vitamins C and E and resveratrol.\n\nDon't use with: Exfoliating acids like glycolic, lactic, and salicylic acids because they can alter the pH, which then changes the effectiveness of the antioxidant."
  },
  {
    "name": "Gluconolactone",
    "facts": "Type of ingredient: Exfoliator.\n\nMain benefits: Improves skin texture and tone, hydrates, offers some antioxidant benefits.\n\nWho should use it: In general, it's good for all skin types, particularly those with sensitive or mature skin who can't tolerate the irritation that can come from AHAs and BHAs, notes Farber.\n\nHow often can you use it: If you're not using any other chemical exfoliants in your routine, it's gentle enough for daily use. Otherwise, use it a few times per week.\n\nWorks well with: Tried and true skincare staples--namely, vitamin C, retinoids, and alpha- and beta-hydroxy acids--as part of an overall anti-aging regimen.\n\nDon't use with: It plays nice with most other ingredients, although you do want to be cautious about over-exfoliation when it's used in tandem with other acids or exfoliants such as retinoids."
  },
  {
    "name": "Glycerin",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Moisturizes skin, smoothes skin, makes skin appear dewy.\n\nWho should use it: Generally, glycerin is safe for all skin types.\n\nHow often can you use it: Products with glycerin can be used topically multiple times a day.\n\nWorks well with: Other moisturizing ingredients, like rose water or hyaluronic acid.\n\nDon't use with: There are no known interactions; however, high glycerin concentrations are rarely used in skincare products."
  },
  {
    "name": "Glycolic Acid",
    "facts": "Type of ingredient: Alpha-hydroxy acid.\n\nMain benefits: Acts as a chemical exfoliant by loosening the bonds between dead skin cells while helping to treat acne. Glycolic acid also stimulates collagen production and acts as a humectant, attracting moisture to the skin.\n\nWho should use it: Glycolic acid is well-tolerated by most skin types and is gentle enough that usually, even those with sensitive skin can use it, says Howe.\n\nHow often can you use it: This depends largely on your skin and the particular product you're using, but in certain situations, it can be used daily.\n\nWorks well with: Other humectants, such as hyaluronic acid, though it's also often combined with lightening ingredients such as kojic acid or hydroquinone.\n\nDon't use with: Be especially cautious when pairing it with other acids and retinoids, cautions Mariwalla."
  },
  {
    "name": "Goat Milk",
    "facts": "Type of ingredient: Gentle exfoliator and intense hydrator.\n\nMain benefits: It draws moisture to skin, softens and nourishes skin, and reduces redness, and it's easier to digest.\n\nWho should use it: This is twofold. In terms of skincare, those with dry, sensitive skin--such as those with eczema and/or acne--can greatly benefit. From a nutritional perspective, those who are lactose intolerant are often better able to digest goat milk. .\n\nHow often can you use it: Regardless of whether it's used for skincare or dietary purposes, goat milk can be used daily. .\n\nWorks well with: Just about everything.\n\nDon't use: If you're allergic to goat milk."
  },
  {
    "name": "Goji Berry",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Promotes collagen and elastin production, reduces hyperpigmentation, reduces oxidative stress.\n\nWho should use it: In general, anyone with uneven skin tone.\n\nHow often is typical use: Once or twice a day.\n\nWorks well with: Hydrators and barrier boosters.\n\nDon't use with: Do not injest goji berries without speaking to your physician. Be sure to check for any medication interactions."
  },
  {
    "name": "Gold for Skin",
    "facts": "Type of ingredient: Metal.\n\nMain benefits: Reduces inflammation, minimizes the appearance of fine lines and wrinkles, and protects skin from free radical damage.\n\nWho should use it: Rodney says that gold in skincare is generally safe, but those with sensitive skin or allergies to metals like gold may need to proceed with caution. \"They can experience rashes, inflammation, and itchy skin,\" says Rodney. It is advised to patch-test gold products to see if your skin can tolerate it or not.\n\nHow often can you use it: Gold can be found in a variety of skincare products that each call for a different set of instructions. Because of this, you should follow the brand's directions as best practice. While the product is an antioxidant that is meant to soothe irritated skin, too much of a good thing can have some less-than-desired effects. \"Using too much can cause other problems like a product overload, where the product is sitting on the surface of your skin, making no impact and even clogging your pores,\" says Rodney. If you're still unsure, Rodney says to use two to three times a week.\n\nWorks well with: Gold nanoparticles are thought to potentially help other ingredients penetrate deeper into the skin, potentially enhancing the product. Ciraldo tells us that antioxidants and peptides should be very safe (and even beneficial) to use in conjunction with gold considering they are great ingredients to begin with. \"Antioxidants are so important--that is the main way to address, prevent, and even sometimes correct free radical damage,\" says Ciraldo. As for peptides, Ciraldo says, \"[Peptides] are an amazing family of ingredients that have so much diversity to them.\".\n\nDon't use with: Across the board, dermatologists recommend skipping gold if you're using retinol in the same routine. Rodney suggests alternating your retinol and gold usage at night to avoid potential irritation. Since AHAs have an exfoliative effect, you may not want to combine an AHA product in the same routine as your gold product. \"AHAs and retinol are in and of itself potentially irritating,\" says Ciraldo. \"I would not want to put gold into my skin with something we know [AHAs and retinol] is irritating.\"."
  },
  {
    "name": "Grapeseed Oil",
    "facts": "Type of ingredient: Oil.\n\nMain benefits: Moisturizes, lightens dark circles, fades scars, tightens skin, prevents sun damage.\n\nWho should use it: All skin types, including sensitive and acne-prone.\n\nHow often can you use it?: Once daily.\n\nWorks well with: Other natural oils like avocado, almond, and jojoba.\n\nDon't use with: Anything harsh or drying that could counteract the oil's emollient qualities (retinol, salicylic acid, etc.)."
  },
  {
    "name": "Green Tea",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Soothes and protects the skin, reduces sebum, and minimizes signs of aging.\n\nWho should use it: In general, green tea is suitable for almost all skin types unless you have a known hypersensitivity to it, according to Kim.\n\nHow often can you use it: Green says not only is it safe to consume green tea daily, but it's also safe to use in your daily skincare routine.\n\nWorks well with: According to Kim, green tea is best used in combination with other antioxidants because they work synergistically. \"Vitamin C helps to reduce degradation of Epigallocatechin gallate or EGCG, and in turn, EGCG can enhance the antioxidant effect of both Vitamins C and E,\" Kim explains. \"There may also be enhanced skin penetration when EGCG is added to hyaluronic acid because of the latter's strongly hydrating properties.\".\n\nDon't use with: According to Kim, there are no products you must avoid when using green tea topically."
  },
  {
    "name": "Hemp Seed Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Reduces inflammation, hydrates, regulates oil production.\n\nWho should use it: In general, people with acneic or combination skin.\n\nHow often can you use it: As often as you would use any oil--roughly twice a day.\n\nWorks well with: Acids and retinoids as it may mitigate the irritation they cause.\n\nDon't use with: Hemp seed oil can be used universally."
  },
  {
    "name": "Homosalate",
    "facts": "Type of ingredient: Chemical sunscreen.\n\nMain benefits: Absorbs UV rays, specifically UVB rays, to ward off damage to the skin cells' DNA known to cause cancer, says Fincher.\n\nWho should use it: Everyone should use sunscreen daily; however, those with sensitive skin may prefer to opt for mineral-based sunscreens.\n\nHow often can you use it: If you're using a sunscreen with homosalate, it can, and should, be used daily and even reapplied every two hours for maximum protection.\n\nWorks well with: It's always paired with other chemical sunscreens such as avobenzone, octinoxate, and octisalate to ensure complete, broad-spectrum UV coverage.\n\nDon't use with: There aren't any specific ingredients known to interact poorly with homosalate, but it (and other chemical sunscreens) can cause skin irritation for some."
  },
  {
    "name": "Honey",
    "facts": "Type of ingredient: humectant.\n\nMain benefits: Antimicrobial, moisturizes and hydrates skin, soothes inflammation, and clarifies to open up pores.\n\nWho should use it: All skin types should use it, but it is especially beneficial for dry, sensitive skin.\n\nHow often can you use it: Usage depends on skin concern. It can be rotated in throughout the week as a treatment.\n\nWorks well with: Honey can be used alone, however, it should be unpasteurized, natural, and active.\n\nDon't use with: Lemon, baking soda, cayenne pepper, or other pantry items."
  },
  {
    "name": "Humectants",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Helps retain moisture in skin, preserves overall properties of products, helps seal cracks in skin, exfoliates, and removes dead skin.\n\nWho should use it: In general, humectants can benefit all skin types because of the range of ingredients that fall under the humectant umbrella. Depending on the amount of moisture you need, you can find the right humectant for your skin type.\n\nHow often can you use it: Typical use is 1-2 times daily. Humectants are often found in daily skincare ingredients, and typically used after face wash in the form of a moisturizer. Humectants are not dangerous, but can steal hydrating from deeper skin layers and in turn dry the skin out if over-applied during non-humid weather. .\n\nWorks well with: Humectants work well with occlusives, which help to seal moisture in, and emollients, which can help to improve the softness and smoothness of the skin. .\n\nDon't use with: Humectants hydrate and lead to the concentration of whatever you apply on the skin to stay on the skin. Therefore, you should be cautious with strong acids and retinoids."
  },
  {
    "name": "Hyaluronic Acid",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Moisturizes skin, reduces appearance of wrinkles, replenishes cell moisture, speeds wound healing.\n\nWho should use it: In general, hyaluronic acid is safe for all skin types, but it is especially helpful for those with dry skin. However, those with rosacea or eczema may want to test patch HA to make sure it doesn't irritate skin.\n\nWhen you can use it: Hyaluronic acid can be applied twice a day topically, in the morning and at night during your skincare routine, but injected hyaluronic acid and ingestible hyaluronic acid should be administered by a doctor.\n\nWorks well with: Vitamin C, vitamin B5, and glycolic acid.\n\nDon't use with: There are no known negative reactions to hyaluronic acid."
  },
  {
    "name": "Hydrocortisone",
    "facts": "Type of ingredient: Corticosteroid (anti-inflammatory).\n\nMain benefits: As a spot treatment, it reduces redness and inflammation from breakouts.\n\nWho should use it: Anyone (who isn't allergic to the ingredient) looking to target a specific inflamed breakout, rather than an area of the face.\n\nHow often can you use it: Apply no more than twice daily for a few days.\n\nWorks well with: Benzoyl peroxide, salicylic acid, sulfur, and retinoids.\n\nDon't use with: Other hydrocortisone products or on cortisone injection sites."
  },
  {
    "name": "Hydrogen Peroxide",
    "facts": "Type of ingredient: Antiseptic agent.\n\nMain benefits: Kills bacteria, heals wounds, dries pimples.\n\nWho should use it: Those who are younger and have a whitehead or a bacterial infection in an acne cyst.\n\nHow often can you use it: Russak recommends using it up to twice a day on a pimple for no longer than two consecutive days.\n\nWorks well with: No ingredient in particular.\n\nDon't use with: Schultz says you shouldn't use it with benzoyl peroxide because of the added irritant effect. (Though if you're using conventional ingredients for acne, you wouldn't need to bother with hydrogen peroxide.)."
  },
  {
    "name": "Hydroquinone",
    "facts": "Type of ingredient: Spot lightener.\n\nMain benefits: Lightens hyperpigmentation and age spots, evens out skin tone.\n\nWho should use it: In general, any skin type can use hydroquinone, however, some skin may be sensitive to it.\n\nHow often can you use it: Hydroquinone can be used once nightly for three-month stretches or until the skin has lightened up.\n\nWorks well with: Shamban explains that the classic formulation with the highest efficacy is 4 percent hydroquinone, .025 percent tretinoin, and mild over-the-counter cortisone.\n\nDon't use with: Generally, hydroquinone is safe to use with most, if not all, ingredients."
  },
  {
    "name": "Isododecane",
    "facts": "Type of ingredient: Emollient and solvent. .\n\nMain benefits: It acts as a moisture-locking barrier for the skin, keeping it hydrated and smooth. In addition to this (and while not a skincare benefit), isododecane contributes to the cream-like or soft texture of many formulas so that they can easily (and evenly) glide silicones and pigments onto the skin. .\n\nWho should use it: Anyone experiencing dryness or anyone who uses makeup, as long as they're not allergic. \"It is great for people with very dry and dull skin, especially those who have impaired barriers from eczema, seborrhea, psoriasis, and rosacea,\" Chimento explains.\n\nWhen you can use it: Isododecane can be applied twice a day topically, in the morning and at night during your skincare routine.\n\nWorks well with: Virtually any other beauty product, as long as you're storing it properly in a cool, dry area. \"It is non-comedogenic and has a matte feel, so it is also great for patients that have oily skin and are acne-prone. Essentially, anyone can use it,\" Chimento says. .\n\nDon't use with: According to Chimento, those with super-sensitive skin types or a known allergy to the ingredient should not use isododecane. ."
  },
  {
    "name": "Isoparaffin",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Isoparrafin makes the skin feel softer and smoother, both by helping to bolster the skin barrier and forming a semi-occlusive film on top of the skin to prevent moisture loss, explains Petrillo.\n\nHow often can you use it: Daily.\n\nWho should use it: According to Howe, it's an especially choice ingredient for those with dry, flaky skin.\n\nWorks well with: Isoparaffin is non-reactive and very synergistic, meaning it goes well with many ingredients, says Frieling.\n\nDon't use with: There are no ingredients known to interact poorly with isoparaffin."
  },
  {
    "name": "Isopropyl Myristate",
    "facts": "Type of ingredient: Emollient, though it also acts as a thickening agent and lubricant in beauty products.\n\nMain benefits: Locks in hydration, enhances the penetration of other ingredients, thickens formulas, and makes those with a high oil content feel silky rather than greasy.\n\nWho should use it: Isopropyl myristate is ideal for anyone with normal to dry skin looking for moisturization benefits, according to Palep.\n\nHow often you can use it: For the best results, follow the directions on the product it's found in, though daily or twice daily use is generally fine.\n\nWorks well with: Isopropyl myristate works well with an assortment of active ingredients, says Solomon, which is why it's found in so many different types of products and formulas.\n\nDon't use with: Because it does enhance penetration, it's important to assess the other ingredients in the formula and whether this increased penetration can cause unexpected side effects such as irritation, cautions Palep."
  },
  {
    "name": "Jojoba Oil",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Hydrates the skin, balances natural oil production, delivers antioxidant protection, has anti-inflammatory effects, may have some antibacterial properties, and can also help reduce acne.\n\nWho should use it: Everyone can use jojoba oil, but it's an especially good choice for those with dry skin or those who are prone to acne or redness, says Nussbaum.\n\nHow often can you use it: It's safe to use daily and even multiple times per day.\n\nWorks well with: Jojoba oil can be combined with many other ingredients--it's a staple in many cosmetic formulations--and is often combined with other emollients, oils, and/or moisturizing ingredients such as shea butter, ceramides, beeswax, and hyaluronic acid.\n\nDon't use with: There are currently no ingredients known to have any kind of negative interaction with jojoba oil."
  },
  {
    "name": "Kaolin Clay",
    "facts": "Type of ingredient: Absorbent, drying agent.\n\nMain benefits: Binds sebum, removes excess oil, mattifies, and draws out impurities.\n\nWho should use it: In general, those with oily or breakout-prone skin looking to control oil and shine would benefit from using kaolin in their skincare routines, but the ingredient is safe for most skin types.\n\nHow often can you use it: Hirsch says for most people, kaolin can be used to treat an oily complexion as little as once a week, but Cook-Bolden says it can be used up to four times weekly, depending on the patient.\n\nWorks well with: Cook-Bolden says other botanicals and minerals that can heal, soothe, and calm the skin can be used along with kaolin, and Hirsch suggests trying chamomile for its potential soothing benefits. .\n\nDon't use with: Cook-Bolden says it's a good idea to avoid using other drying agents in conjunction with kaolin."
  },
  {
    "name": "Karanja Oil",
    "facts": "Type of ingredient: Hydrating antioxidant.\n\nMain benefits: Anti-inflammatory, acts as an astringent, and protects the scalp barrier.\n\nWho should use it: All skin types and hair types can benefit from Karanja oil. .\n\nHow often can you use it: Karanja oil is not protein-based, so it can be safely used daily, says Phyto national educator Jennifer Fairchild.\n\nWorks well with: Karanja oil works well with a variety of ingredients, like softening hibiscus extract, reparative yacon extract, and hydrating coconut oil.\n\nDon't use with: There is no limit when pairing this ingredient with other botanical extracts, according to Fairchild."
  },
  {
    "name": "Kigelia Africana",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Reduces the appearance of fine lines and wrinkles, tightens skin, evens skin tone, and calms the complexion overall.\n\nWho should use it: Since Kigelia Africana has calming properties, Engelman says that it's an especially great ingredient for sensitive skin types, as it \"delivers anti-aging and clear-skin benefits without the irritating side effects caused by some other ingredients that are used to target the same skin concerns.\" .\n\nHow often can you use it: Roestorf recommends using Kigelia Africana twice daily--\"In the morning to provide a protective barrier for skin, at night to repair and rebalance,\" she says, noting that a serum infused with the ingredient is your best bet to seal the beneficial ingredient in without letting moisture seep out.  .\n\nWorks well with: Many different ingredients. Roestorf says that pairing it with vitamin C, bilberry, sugar cane, and citrus extracts works well to fight off free radicals, while combining it with niacinamide and cucumber extract can lend to its soothing and restorative properties. .\n\nDon't use with: According to Roestorf, there are currently no known ingredients that can not be formulated with Kigelia Africana."
  },
  {
    "name": "Kojic Acid",
    "facts": "Type of ingredient: Skin brightener.\n\nMain benefits: Inhibits an enzyme necessary in the production of melanin, helping to fade dark spots and discoloration. It also delivers some antioxidant protection.\n\nHow often to use it: This depends on what other ingredients it's compounded with and the concentration, but generally it can be used daily.\n\nWorks well with: Studies have shown that kojic acid works well with and enhances the effects of glycolic acid and hydroquinone, says Nazarian.\n\nDon't use with: While it does have a synergetic effect when used with these other brightening/exfoliating ingredients, pairing it with these also increases the likelihood of experiencing excessive dryness or irritation. Proceed with caution and start using any products that contain kojic acid and other actives gradually, giving your skin some time to acclimate."
  },
  {
    "name": "Kukui Nut Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Deeply hydrates skin, improves texture, heals and protects skin.\n\nWho should use it: While kukui nut oil is typically gentle enough for most skin types, Hanalei founder Alice Kim says that it is especially transformative for dry and/or aging skin thanks to its powerful hydrating and nourishing properties.\n\nHow often can you use it: Generally speaking, kukui nut oil can be used twice daily. Of course, it depends on your particular skin type and how it reacts to the ingredient.\n\nWorks well with: According to Kim, kukui nut oil blends especially well with ingredients that are lipophilic (aka they can dissolve in oil).\n\nDon’t use with: Thanks to its natural and gentle nature, kukui nut oil typically pairs well with just about anything. That said, if you have very oily skin, you may not want to mix it with multiple other oils, as it could exacerbate the shiny appearance of your complexion."
  },
  {
    "name": "Lactic Acid",
    "facts": "Type of ingredient: Acid/exfoliator.\n\nMain benefits: Firmer, thicker skin, resulting in fewer fine lines, wrinkles, and acne lesions.\n\nWho should use it: In general, anyone with acne-prone skin or who frequently breaks out.\n\nHow often can you use it?: It's only recommended for use once a day at maximum, but should probably be used once every few days.\n\nWorks well with: Hydrating ingredients like hyaluronic acid.\n\nDon't use with: Other acids and exfoliants like AHAs or benzoyl peroxide. Retinol should be avoided as well."
  },
  {
    "name": "Lactobionic Acid",
    "facts": "Type of ingredient: Acid.\n\nMain benefits: Exfoliates, is gentler than regular acids, acts as humectant.\n\nWho should use it: In general, people with sensitive skin benefit most from lactobionic acid usage.\n\nHow often can you use it: Once a day.\n\nWorks well with: Other acids.\n\nDon't use with: Retinol."
  },
  {
    "name": "Lanolin",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Locks moisture into the skin, extremely rejuvenating and healing, allows the skin to moisturize itself from within.\n\nWho should use it: In general, those with dry or damaged skin would benefit most from using lanolin products.\n\nHow often can you use it?: Lanolin products can be used daily, both morning and night.\n\nWorks well with: Lanolin works best alongside other moisturizing products, as it assists in locking moisture into the skin.\n\nDon't use with: In general, lanolin is safe to use with most ingredients and products."
  },
  {
    "name": "Lavender Oil",
    "facts": "Type of ingredient: Essential oil.\n\nMain benefits: Soothes skin, improves acne, protects against free radicals, and combats bacterial and fungal disorders.\n\nWho should use it: In general, anyone with acne-prone skin who does not have a contact allergy to lavender or fragrance and does not have sensitive skin.\n\nHow often can you use it: Provided you do not have an allergy to the ingredient, lavender oil is safe to use in your daily routine, and how often it is used depends on the type of product.\n\nWorks well with: Lavender oil can be diluted in a carrier solution, such as a fatty oil. \"When lavender is mixed with coconut, jojoba, or grapeseed oil, it has wonderful benefits on the skin,\" Guanche says.\n\nDon't use with: Inform your doctor of any medications you're taking or products you're using before trying lavender oil."
  },
  {
    "name": "Lemon Juice",
    "facts": "Type of ingredient: Exfoliator (The primary ingredient in lemon juice that's worth calling out for skincare purposes is citric acid, an alpha-hydroxy acid).\n\nMain benefits: Sloughs away dead skin cells, clears sebum and dirt from pores (which may help prevent blackhead formation, says Nussbaum), and may also have antibacterial properties.\n\nWho should use it: None of the dermatologists we spoke with advised using lemon juice as a treatment for blemishes. However, if you still want to try it, only do so if your acne is mild, and never apply it on a recently-popped pimple or open sore, cautions Henry.\n\nHow often can you use it: Very sparingly if you are going to try it--no more than once a day, every other day.\n\nWorks well with: There's no ingredient, in particular, that should be paired with lemon juice when using it as a spot treatment.\n\nDon't use with: Other topical acids or any kind of retinoid, given that the combination will only increase the (already very high) potential of irritation from the lemon juice."
  },
  {
    "name": "Licorice Extract",
    "facts": "Type of ingredient: Skin brightener.\n\nMain benefits: Inhibits the production of an enzyme needed to produce melanin (pigment) in the skin, helps remove excess melanin, has anti-inflammatory benefits.\n\nWho should use it: Anyone looking to reap the spot-fading, skin tone-evening benefits, as well as those looking to soothe irritated skin. Plus, it's a good option for pregnant women looking for a safe way to treat melasma, unlike hydroquinone which cannot be used by pregnant women.\n\nHow often can you use it: This largely depends on the particular product formulation, but in most cases, once or twice a day, maximum, says Chwalek.\n\nWorks well with: Because of its main benefits, it's often mixed with other antioxidants and skin brighteners, such as niacinamide and vitamin C.\n\nDon't use with: Because it does have the potential to be somewhat irritating, Linkner advises not using it in conjunction with retinol and/or hydroquinone."
  },
  {
    "name": "Lysine",
    "facts": "Type of ingredient: Essential amino acid.\n\nMain benefits: Builds protein and collagen and brings energy to the body.\n\nWho should use it: As an essential amino acid, Talakoub says everyone needs lysine as a part of their nutrition.\n\nHow often can you use it: Lysine should be consumed as a part of your daily diet. Those with a lysine deficiency may need to take a daily supplement, but Talakoub stresses that it's better to eat the lysine through a healthy, balanced diet than it is to take artificial supplements.\n\nWorks well with: Other amino acids. \"Taking one amino acid isn't going to help build collagen or proteins in the body,\" Talakoub says. \"But taking all the amino acids together will help build more of the proteins in your body.\".\n\nDon't use with: \"Lysine does increase the transportation of calcium in the body, and most people that have normal metabolisms can tolerate it, and most people actually need some calcium in their body,\" Talakoub explains. \"However, if you're taking a calcium supplement, you probably shouldn't be taking lysine together with it.\"."
  },
  {
    "name": "Madecassoside",
    "facts": "Type of ingredient: Antioxidant and anti-inflammatory.\n\nMain benefits: Reduces free radicals, inhibits inflammation, and improves skin hydration.\n\nWho should use it: According to Chang, madecassoside may be beneficial for inflamed, acne-prone skin, and photodamaged skin.\n\nHow often can you use it: As infrequently or as often as necessary, but it's gentle enough to use twice daily.\n\nWorks well with: Its antioxidant properties are enhanced when paired with vitamin C, and combining it with hyaluronic acid can also augment its hydrating effects, says Obioha.\n\nDon't use with: There are no ingredients known to interact negatively with madecassoside. In fact, it can even be paired with many potentially-irritating actives due to its soothing effects, notes Obioha."
  },
  {
    "name": "Magnesium",
    "facts": "Type of ingredient: Mineral.\n\nMain benefits: When used in skincare, magnesium may reduce acne, calm sensitive skin and rosacea, and improve the skin's overall appearance.\n\nWho should use it: In general, all skin types can benefit from magnesium usage. However, those with oily, acne-prone skin will most likely benefit the most.\n\nHow often can you use it: Topically, magnesium products can be used daily, preferably at night. If ingested, be careful not to exceed 350mg daily.\n\nWorks well with: Vitamin C.\n\nDon't use with: Magnesium absorption-inhibitors, such as high doses of zinc and phosphates. Stress can also cause a magnesium deficiency."
  },
  {
    "name": "Magnesium Aluminum Silicate",
    "facts": "Type of ingredient: A natural clay.\n\nMain benefits: It's used strictly for formulation purposes, including acting as an absorbent, emulsion stabilizer and helping to thicken products.\n\nWho should use it: It hasn't been found to be irritating, so anyone can use it (unless you have an allergy to it), says Hayag.\n\nHow often can you use it: Magnesium aluminum silicate is found in many products that are used daily.\n\nWorks well with: Pretty much all other ingredients, which is why it's so often-used. Hayag adds that it plays especially nicely with other thickeners, such as cellulose gum and xanthan gum.\n\nDon't use with: There are no ingredients known to interact negatively with magnesium aluminum silicate."
  },
  {
    "name": "Malic Acid",
    "facts": "Type of ingredient: Exfoliant.\n\nMain benefits: Exfoliates dead cells on the outermost layer of the skin and promotes cell turnover, leaving skin brighter and more even, and also helping to keep pores unclogged.\n\nWho should use it: Anyone looking to fade discoloration and/or achieve more radiant skin, as well as those who are acne-prone. It's also a good choice for those with sensitive skin and for whom other acids may be too irritating. .\n\nHow often can you use it:  Malic acid can be used once or twice daily, depending on what other ingredients it's combined with. .\n\nWorks well with: Other alpha-, as well as beta-hydroxy acids at lower doses for synergistic effects, as well as hydrating ingredients such as glycerin and hyaluronic acid. Palep also likes pairing with vitamin C to boost the brightening benefits.\n\nDon't use with: Be cautious when using it with other acids, or notoriously harsh or irritating ingredients such as retinoids. ."
  },
  {
    "name": "Mandelic Acid",
    "facts": "Type of ingredient: Exfoliator.\n\nMain benefits: Increase in cell turnover, anti-acne, anti-aging.\n\nWho should use it: In general, people with sensitive or acneic skin who want an exfoliant that's less harsh than traditional AHAs.\n\nHow often can you use it: A few times weekly depending on your skin type. Use less often in sensitive skin types to avoid over-exfoliation.\n\nWorks well with: Hyaluronic acid, other hydrators.\n\nDon't use with: Other AHAs, other peels, retinol, retinoids."
  },
  {
    "name": "Manuka Honey",
    "facts": "Type of ingredient: Antibacterial/antiviral/anti-fungal, as well as an anti-inflammatory and humectant.\n\nMain benefits: Aids in wound healing due to its antibacterial and anti-inflammatory properties; draws in moisture to the skin, and can soothe irritated skin conditions such as eczema and psoriasis.\n\nWho should use it: Anyone looking for hydrating and soothing benefits; manuka honey may also be beneficial for those with eczema and acne, notes Chang.\n\nHow often can you use it: It can be used once or twice daily.\n\nWorks well with: Manuka honey works synergistically with other antibiotic ingredients, as well other wound-healing ingredients. It also works well when combined with other hydrating ingredients--such as shea butter and glycerin--to moisturize the skin, says Chang.\n\nDon't use with: There are no specific ingredients known to have a negative interaction with manuka honey at the moment, though Linkner cautions that, to be safe, it's best to not pair it with potent active ingredients (think retinoids or acids)."
  },
  {
    "name": "Marshmallow Root Extract",
    "facts": "Type of ingredient: Anti-inflammatory.\n\nMain benefits: Soothes redness, relieves inflammation, and helps retain moisture.\n\nWho should use it: In general, people with sensitive and easily irritated skin.\n\nHow often you can use it: Twice a day.\n\nWorks well with: Products that may otherwise cause irritation.\n\nDon't use with: If you're diabetic, don't take it as a supplement because it might lower blood sugar."
  },
  {
    "name": "Marula Oil",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Seals-in hydration and softens skin, offers antioxidant protection, has anti-inflammatory effects, has some antibacterial properties.\n\nWho should use it: Marula oil is good for all skin types, says Haley, though, as with most oils, it's especially choice for those with very dry or cracked skin.\n\nHow often can you use it: Marula oil can be used daily.\n\nWorks well with: There aren't any known ingredients that it should be used with, though Rabach points out it can be layered over products with active ingredients (retinoids, peptides, antioxidants) to help seal them into skin and boost their efficacy.\n\nDon't use with: There are currently no known ingredients that will interact negatively with marula oil, although you can always have too much of a good thing. Avoid using any other oils in your routine to try to better maintain balanced skin."
  },
  {
    "name": "Meadowfoam Seed Oil",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Seals in moisture and softens skin.\n\nWho should use it: Because meadowfoam seed oil is similar to natural sebum, Chimento says the ingredient is suitable for all skin types.\n\nHow often can you use it: Meadowfoam seed oil is safe to use daily. Chimento recommends adding a few drops into a daily moisturizer and also incorporating it into a nightly routine for those with dry skin.\n\nWorks well with: Robinson recommends using it in conjunction with other skincare oils and butters.\n\nDon't use with: Because meadowfoam seed oil is a very stable oil, Robinson says it's compatible with many other cosmetic ingredients."
  },
  {
    "name": "Methylparaben",
    "facts": "Type of ingredient: Preservative.\n\nMain benefits: Prevents fungus growth, preserves ingredients, creates antibacterial formulas.\n\nHow often can you use it: Methylparaben is found in many daytime and nighttime products. As such, it can be used multiple times per day.\n\nWorks well with: Since methylparaben lengthens the 'shelf-life' of ingredients, dermatologists say that it works well with all ingredients.\n\nDon't use with: Methylparaben is generally safe to use with all ingredients thanks to its preserving nature."
  },
  {
    "name": "Mineral Oil",
    "facts": "Type of ingredient: Moisturizer.\n\nMain benefits: Locks moisture into the skin, softens skin, and improves skin barrier function.\n\nWho should use it: \"I recommend mineral oil for those with dry, sensitive skin, and it can even be used for those with conditions such as eczema or psoriasis,\" says Chang. She notes that not only is it a good moisturizing ingredient, but it also has a very low risk of allergic reactions or irritation. Mineral oil products aren't recommended for acne-prone skin.\n\nHow often can you use it: This depends largely on the specific product you're using and how dry your skin is, but generally speaking, it's fine to use once or twice daily.\n\nWorks well with: Humectant ingredients such as glycerin or hyaluronic acid, which attract moisture to the skin, that the mineral oil can then lock-in.\n\nDon't use with: Because it is very occlusive, don't use it with pore-clogging ingredients, notes Nussbaum, particularly if you start to notice blackheads and whiteheads. (More on whether or not it can clog your pores in a minute)."
  },
  {
    "name": "Moringa Oil",
    "facts": "Type of ingredient: Oil.\n\nMain benefits: Reduces fine lines and wrinkles, improves the overall appearance of the skin, soothes inflammation.\n\nWho should use it: In general, all skin types can benefit from using moringa oil.\n\nHow often can you use it?: Usage varies depending on the specific product, but in general, moringa oil can be used daily, both morning and night.\n\nWorks well with: Moringa oil works well with most ingredients.\n\nDon't use with: It can be used with most ingredients."
  },
  {
    "name": "Murumuru Butter",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Deeply moisturizes, reduces inflammation, sensitive skin-friendly.\n\nWho should use it: In general, anyone with dry and/or sensitive skin. Murumuru butter is not recommended for acne-prone skin types.\n\nHow often can you use it: Murumuru-infused skincare products can be used daily for optimal hydration. Just be sure to steer clear of regular use of the ingredient if you have acne-prone skin. .\n\nWorks well with: According to Garshick, because murumuru butter is a hydrating and soothing ingredient, it can be paired with most other ingredients. \"It may be especially effective when used with a humectant such as hyaluronic acid or glycerin, as these help to draw moisture in, and murumuru can help to keep that moisture in place,\" she says. Patel adds to this, noting that murumuru butter works well with other emollients such as cocoa butter, avocado oil, shea butter, vitamin E, and coconut oil, as well. .\n\nDon't use with: According to Patel, murumuru butter shouldn't be mixed with sunscreen. \"The chemicals in sunscreen may not be as effective when layered over murumuru butter,\" she says."
  },
  {
    "name": "Muslin Cloths",
    "facts": "Type of product: Cleansing cloth.\n\nMain benefits: Gently exfoliates, deeply cleanses, and reduces inflammation.\n\nWho should use it: It is recommended for people of all ages and skin types, especially those with easily irritated, overly sensitized skin.\n\nHow often can you use it: It can be used daily, morning and night, so long as it's used with light pressure. .\n\nWorks well with: Gel, oil, and balm cleansers.\n\nDon't use with: Exfoliating scrubs."
  },
  {
    "name": "Neem Oil",
    "facts": "Type of ingredient: Essential oil.\n\nMain benefits: Neem oil kills bacteria and fungus and is also an anti-inflammatory.\n\nWho should use it: Those with acne-prone skin and red, itchy, and inflamed skin associated with psoriasis, acne, and eczema rashes (among others).\n\nHow often can you use it: After a patch test, if your skin does not have a negative reaction, you can incorporate it as the last step in your morning and nighttime skincare routines.\n\nWorks well with: Non-comedogenic carrier oils, like almond oil.\n\nDon't use with: Neem oil works well with most skincare products."
  },
  {
    "name": "Niacinamide",
    "facts": "Type of ingredient: Brightener.\n\nMain benefits: Brightening, prevents signs of aging, reduces acne.\n\nWho should use it: In general, anyone who wants their skin to be bright or prevent aging.\n\nHow often can you use it?: You can use it in both morning and evening.\n\nWorks well with: \"When using vitamin B3, it is good to combine it with other stable and powerful antioxidants, such as camellia sinensis (green tea) catechins, quercetin, and tocopherol,\" says Mun. It may also ease irritation related to retinol and skin redness generally.\n\nDoesn't work with: Vitamin B3 works well with everything."
  },
  {
    "name": "Nizoral",
    "facts": "Type of ingredient: Anti-fungal.\n\nMain benefits: Treats fungal infections, reduces the overgrowth of fungus, prevents fungal acne. .\n\nWho should use it: Anyone struggling with fungal acne, regardless of skin type. .\n\nHow often can you use it: Every day, or every other day, for two to three weeks, in which time you should see improvement. If your condition clears up, use it twice weekly as a maintenance medication. If you haven't seen changes in two to three weeks, talk to your doctor about other treatment options. .\n\nWorks well with: Salicylic acid and beta-hydroxy acid.\n\nDon't use with: Oily moisturizers or topical antibiotics."
  },
  {
    "name": "Octinoxate",
    "facts": "Type of ingredient: Chemical UV filter.\n\nMain benefits: Prevents sunburn, decreases the risk of skin cancer, doesn't leave a white cast.\n\nWho should use it: Anyone over the age of six months looking for a chemical sunscreen to protect their skin from UVB rays, especially those with oily skin and darker skin tones that struggle with mineral sunscreen.\n\nHow often can you use it: In general, it's safe to use daily.\n\nWorks well with: To get broad-spectrum protection, octinoxate will often be combined with avobenzone (a chemical UVA filter). To help stabilize the avobenzone, it typically will come with another filter, octocrylene.\n\nDon't use with: Chemical peel ingredients like glycolic acid."
  },
  {
    "name": "Octisalate",
    "facts": "Type of ingredient: Chemical sunscreen.\n\nMain benefits: Absorbs UVB rays, those responsible for causing burning of the skin. It also stabilizes other sunscreen ingredients and makes formulas more water-resistant, says Parks.\n\nWho should use it: Anyone who wants an effective, long-lasting sunscreen, says Hu, with the one caveat being that those who are allergic to it should obviously steer clear.\n\nWorks well with: Other chemical sunscreen ingredients, specifically those that absorb UVA rays, such as octocrylene and avobenzone.\n\nDon't use with: According to the experts we spoke with, there are no ingredients known to interact negatively with octisalate."
  },
  {
    "name": "Octocrylene",
    "facts": "Type of ingredient: Chemical sunscreen.\n\nMain benefits: Protects against UV rays as well as stabilizes other chemical sunscreen ingredients.\n\nWho should use it: Anyone looking for an effective chemical sunscreen formula.\n\nHow often can you use it: Daily, though, it should also be reapplied every two hours, particularly if you're swimming or sweating, says Lain.\n\nWorks well with: Other chemical sunscreen ingredients, particularly avobenzone.\n\nDon't use with: According to the experts we spoke with, there are no ingredients known to interact with octocrylene negatively."
  },
  {
    "name": "Olive Oil",
    "facts": "Type of ingredient: Emollient, antioxidant, anti-inflammatory.\n\nMain benefits: Moisturizes dry skin, protects against premature aging, manages sun damage.\n\nWho should use it: In general, most skin types can benefit from olive oil, but those with sensitive, acne-prone skin should steer clear.\n\nHow often can you use it: Olive oil is safe to use on the skin daily.\n\nWorks well with: Humectants like glycerin, hyaluronic acid, and amino acids.\n\nDon't use with: Generally, olive oil is safe to use with most ingredients."
  },
  {
    "name": "Oxybenzone",
    "facts": "\n\nType of ingredient: Organic compound.\n\nMain benefits: Protects from UVA damage and protects from UVB damage.\n\nHow often can you use it: Sunscreen should be applied every two hours, or sooner after swimming or sweating.\n\nWorks well with: In general, antioxidants have been shown to boost the efficacy of sunscreen and deliver other skin perks as well.\n\nDon't use with: There aren't any specific ingredients you should avoid using with oxybenzone."
  },
  {
    "name": "Panthenol",
    "facts": "Type of ingredient: Moisturizer.\n\nMain benefits: Binds to and holds water in the skin, moisturizing and leaving it soft, smooth, and more supple. It also has anti-inflammatory properties and is involved in activating the proliferation of cells that are important for wound healing and restoring the function of the skin barrier.\n\nWho should use it: In general, panthenol is good for all skin types, and particularly those with dry or flaky skin.\n\nHow often can you use it: You can use products containing panthenol daily.\n\nWorks well with: Humectants like hyaluronic acid and glycerin, as well as ceramides.\n\nDon't use with: In general, panthenol can be used with most ingredients."
  },
  {
    "name": "Peppermint Oil",
    "facts": "Type of ingredient: Antibacterial.\n\nMain benefits: Delivers soothing and cooling properties that can be helpful for minor skin irritations; controls the secretion of oil.\n\nWho should use it: Those with oily or acne-prone skin, though it shouldn't be the only ingredient relied on to address acne, notes Frieling. Anyone with minor skin irritations and itching may also find it beneficial.\n\nHow often can you use it: Generally speaking, once per day, though be cautious as overuse can lead to irritation.\n\nWorks well with: Combined and diluted with hydrating ingredients such as aloe vera and coconut oil that can be beneficial for dry and irritated skin.\n\nDon't use with: Be cautious when pairing with products that contain acids or other harsh exfoliating ingredients, especially if you have sensitive skin."
  },
  {
    "name": "Petroleum Jelly",
    "facts": "Type of ingredient: Occlusive.\n\nMain benefits: Seals in moisture, soothes cuts and abrasions, accelerates the healing process.\n\nWho should use it: In general, it's safe for all ages and skin types and is especially beneficial for those with minor wounds and dry, sensitive skin.\n\nHow often can you use it: Petroleum jelly is safe to use daily.\n\nWorks well with: Moisturizers.\n\nDon't use with: Very oily, acne-prone skin."
  },
  {
    "name": "Polyglutamic Acid",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Moisturizes skin, reduces the appearance of wrinkles and pores, replenishes cell moisture.\n\nWho should use it: It is ideal for anyone with dry or dehydrated skin. Polyglutamic acid is safe for all skin types, however, if you have sensitive skin it is always best to patch test a new product.\n\nWhen you can use it: Polyglutamic acid can be morning and night.\n\nWorks well with: It plays nicely with other skincare ingredients, especially hyaluronic acid and vitamin C.\n\nDon’t use with: There are no known negative reactions with polyglutamic acid."
  },
  {
    "name": "Polyhydroxy Acid (PHA)",
    "facts": "Type of ingredient: Exfoliant.\n\nMain benefits: Repairs skin, exfoliates away dead skin, reduces the appearance of skin damage.\n\nWho should use it: PHAs are usually safe for all skin types, but especially for those with oily or acne-prone skin.\n\nHow often can you use it: To start, try using PHAs three times a week. You can use it in the form of a toner, a face wash, or even a serum.\n\nWorks well with: Other acids in low concentrations.\n\nDon't use with: Other acids in very high concentrations, retinoids if you're particularly sensitive."
  },
  {
    "name": "Phenoxyethanol",
    "facts": "Type of ingredient: Preservative.\n\nMain benefits: Prevents the growth of bacteria, enhances shelf life, and stabilizes products.\n\nWho should use it: In general, anyone without an allergy. Phenoxyethanol is not recommended for those with sensitive skin or eczema.\n\nHow often can you use it: Daily.\n\nWorks well with: Other preservatives.\n\nDon't use with: Phenoxyethanol works well with most, if not all, ingredients."
  },
  {
    "name": "Phytosphingosine",
    "facts": "Type of ingredient: Moisturizer.\n\nMain benefits: Skin barrier support, anti-inflammatory, anti-bacterial.\n\nWho should use it: Almost anyone can benefit.\n\nHow often should you use it: Daily.\n\nWorks well with: Ceramides, peptides.\n\nDon't use with: N/A."
  },
  {
    "name": "Plum Oil",
    "facts": "Type of ingredient: Plum oil is a hydrator and anti-inflammatory.\n\nMain benefits: Brightens and plumps skin, protects against radical damage and oxidative stress, and aids in cellular repair, sebum production, and skin turnover, according to our experts.\n\nWho should use it: In general, plum oil is beneficial to all skin types as it is a lightweight, noncomedogenic oil and safe for acne-prone skin. Of course, if you are allergic to plums, you should avoid.\n\nHow often can you use it: It's safe to use plum oil twice per day--in the morning, beneath moisturizer and makeup, and at night, as part of your evening skin routine. It can also be used on the ends of damp hair to add extra moisture and protect against heat damage.\n\nWorks well with: Antioxidants like vitamins E, C, and A, which are all found in high concentrations of plum oil. It is sometimes paired with other lightweight antioxidant-rich oils like pomegranate seed oil and buckthorn seed oil.\n\nDon't use with: Plum oil has no known counter-indications."
  },
  {
    "name": "Polypeptides",
    "facts": "Type of ingredient: Protein.\n\nMain benefits: Smoothes fine lines, increases collagen production, decreases the appearance of pores.\n\nWho should use it: Generally, polypeptides are safe for all skin types.\n\nHow often you can use it: For maximum effectiveness, polypeptides should be applied during both morning and nighttime skincare routines.\n\nWorks well with: Getting a facial peel before applying peptide products may help peptides penetrate the skin more deeply.\n\nDon't use with: AHAs may reduce the efficiency of peptides."
  },
  {
    "name": "Pomegranate",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Helps skin regenerate, detoxes the skin, protects against UV radiation.\n\nWho should use it: In general, people with oily or congested skin will find pomegranate the most beneficial.\n\nHow often is typical use?: Once a day.\n\nWorks well with: Ceramides.\n\nDoesn't work with: Works with everything."
  },
  {
    "name": "Prickly Pear Oil",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Anti-inflammatory, barrier-boosting, hydrating.\n\nWho should use it: In general, anyone with sensitive skin in need of hydration, or with hyperpigmentation issues.\n\nHow often is typical use?: Twice a day.\n\nWorks well with: Retinols or Vitamin C, which might otherwise irritate the face."
  },
  {
    "name": "Probiotics",
    "facts": "Type of ingredient: Bacterial supplement.\n\nMain benefits: Calms internal and external inflammation, restores skin barrier function, and offers protection from harmful environmental particles.\n\nWho should use it: While anyone can benefit from probiotics, they will be especially helpful for those with inflammatory skin conditions like acne, eczema, or rosacea, or anyone suffering from dryness or sensitivity due to a disrupted skin barrier.\n\nHow often can you use it: It is safe to use both oral and topical probiotics daily, both morning and night.\n\nWorks well with: Ingredients like ceramides, which also help strengthen skin's protective barrier."
  },
  {
    "name": "Progeline Cream",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Hydrates skin, acts as a humectant, could reduce signs of aging.\n\nWho should use it: Progeline cream is suitable for most skin types.\n\nHow often can you use it: It can be used daily.\n\nWorks well with: There aren't any available studies to show interactions with other ingredients.\n\nDon't use with: This ingredient hasn't been proven to interact with other ingredients."
  },
  {
    "name": "Propanediol",
    "facts": "Type of ingredient: Solvent, humectant, and emollient.\n\nMain benefits: Dissolves ingredients, decreases viscosity, and retains moisture.\n\nWho should use it: Generally, anyone looking for an alternative to propylene glycol in their skincare.\n\nHow often can you use it: Propanediol is a safe ingredient to use regularly, provided that you do not have a sensitivity to it.\n\nWorks well with: Because of its wide range of uses, propanediol does not function especially well with any ingredient in particular.\n\nDon't use with: According to dermatologists, propanediol works well with most, if not all, ingredients."
  },
  {
    "name": "Propolis",
    "facts": "Type of ingredient: Antioxidant/anti-inflammatory/antimicrobial.\n\nMain benefits: Heals wounds, treats acne aftermath, and protects the skin.\n\nWho should use it: In general, Dhingra says those who are not allergic to the ingredient and are looking to heal mild wounds or treat scarring, pigmentation, and texture caused by acne could benefit from using propolis.\n\nHow often can you use it: The application of propolis depends on the particular product and what it's being used to treat. Dhingra says if someone does not have an allergy to propolis, it would be safe to safe to use daily. \"But if any form of a reaction develops, then propolis should be [suspected] as a trigger and avoided in the future,\" he adds.\n\nWorks well with: Dhingra says the products paired with propolis will depend on the intended goal.\n\nDon't use with: According to Dhingra, there are no formal studies and nothing reported that needs to explicitly be avoided. ."
  },
  {
    "name": "Propylene Glycol",
    "facts": "Type of ingredient: Humectant, solvent, emollient, and preservative.\n\nMain benefits: Attracts water and locks it into the skin.\n\nWho should use it: In general, anyone who is looking for extra hydration and smoothness of the skin.\n\nHow often can you use it: Propylene glycol is a safe ingredient to use regularly, provided that you do not have an allergy to it.\n\nWorks well with: Because it has so many functions, there isn't a specific list of ingredients that it works well with.\n\nDon't use with: Propylene glycol works well with most, if not all, ingredients."
  },
  {
    "name": "Propylparabens",
    "facts": "Type of ingredient: Preservative.\n\nMain benefits: Any kind of paraben helps to enhance the shelf life and safety of a cosmetic product by preventing the growth of microorganisms, explains Clark.\n\nWho should use it: Parabens, propylparabens included, are found in many commonly used skincare and personal care products. More often than not, most people are already using a product that contains these ingredients.\n\nHow often can you use it: Many of these products are the ones we use daily, such as creams, lotions, and shampoos.\n\nWorks well with: The majority of ingredients, hence their prevalence.\n\nDon't use with: There are no ingredients known to interact negatively with propylparabens."
  },
  {
    "name": "Purslane Extract",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Anti-aging, calms skin, reduces redness, helps skin retain moisture.\n\nWho should use it: In general, purslane has a wide range of benefits and can be used by everyone, including those with sensitive skin.\n\nHow often can you use it: Purslane extract is safe to use up to twice a day, morning and night. .\n\nWorks well with: Because purslane extract is considered gentle, soothing, and provides antioxidant benefits, it can be used with almost any product. Purslane extract works particularly well with other antioxidants such as vitamin C, niacinamide, and other hydrating ingredients. .\n\nDon't use with: Purslane extract does not interact with other ingredients and generally can be used safely within all skincare routines. ."
  },
  {
    "name": "Pycnogenol",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Prevents wrinkles, increases hydration, reduces age spots.\n\nWho should use it: In general, people with concerns about aging.\n\nHow often you can use it: Once a day.\n\nWorks well with: Anti-aging skincare products.\n\nDon't use with: Diabetics and people on immunosuppressants like prednisone should avoid it due to negative drug interactions."
  },
  {
    "name": "Quercetin",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Reduces the harmful effects of UV radiation and reduces inflammation.\n\nWho should use it: According to Robinson, topical quercetin can be safely used by most skin types; however, those with more sensitive skin should proceed slowly. .\n\nHow often can you use it: Quercetin is generally safe to use daily.\n\nWorks well with: Robinson says, in general, quercetin works best with ceramides, and in its antioxidant role, it works well with sunscreens. When used in conjunction with sunscreen, topical antioxidants, like quercetin, can help reduce oxidative stress.\n\nDon't use with: Quercetin works well with most other ingredients."
  },
  {
    "name": "Reishi Mushrooms",
    "facts": "Type of ingredient: Hydrator, antioxidant.\n\nMain benefits: Restores moisture loss, fights fine lines and wrinkles, reduces stress, improves sleep, boosts immune system.\n\nWho should use it: In general, all skin types and those who have low energy or heart conditions can benefit from reishi mushrooms. Those with low blood pressure or bleeding disorders should avoid it.\n\nHow often can you use it: Reishi mushrooms can be consumed whole or in extract or powdered form. For skincare, formulas with reishi mushrooms can be used twice a day in the morning and evening.\n\nWorks well with: Other mushrooms, particularly shiitake and maitake, as well as anti-inflammatory, soothing botanicals.\n\nDon't use with: Generally, reishi mushrooms are safe to use with most, if not all, ingredients."
  },
  {
    "name": "Resveratrol",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Fights aging, protects the skin, and improves the overall appearance of skin.\n\nWho should use it: Green says that, in general, anyone who has sun damage can use resveratrol, regardless of their skin type.\n\nHow often can you use it: According to Green, it's safe to use daily as long as you know how your skin responds to the antioxidant.\n\nWorks well with: Most other powerful antioxidants, like ferulic acid.\n\nDon't use with: Neither dermatologist is aware of any ingredient that will deactivate the function of resveratrol."
  },
  {
    "name": "Retin-A",
    "facts": "Type of ingredient: Exfoliant.\n\nMain benefits: Increases cell turnover, antioxidant.\n\nWho should use it: In general, anyone who wants to prevent bad acne or wrinkles.\n\nHow often can you use it: Once a day, maximum. Any more and you're risking serious irritation.\n\nWorks well with: Hydrators, antioxidants.\n\nDoesn't work with: Vitamin C, physical and chemical exfoliants, other retinol formulas."
  },
  {
    "name": "Retinaldehyde",
    "facts": "Type of ingredient: Exfoliator.\n\nMain benefits: Promotes skin cell turnover, improves skin tone, helps unclog pores, and thickens the dermis to slow down the formation of wrinkles.\n\nWho should use it: Anyone looking for the anti-aging effects of a retinoid, especially those who have used and can tolerate retinol or retinyl palmitate, but aren't seeing the results they want. In this case, you can up the ante to retinaldehyde, which can be more potent and effective at jumpstarting your skin cells, says Nussbaum.\n\nHow often can you use it: While it's important to ease into things to let your skin gradually acclimate to the ingredient, it can ultimately be used daily.\n\nWorks well with: Alpha- and beta-hydroxy acids have commonly been used with retinoids to help further increase skin cell turnover, says Chilukuri (though it's important to make those separate parts of your routine, using once in the morning and once at night). Using antioxidants such as vitamin C, vitamin E, and niacinamide can also help improve the skin's brightening effects, he adds. However, use these ingredients together with caution, and decrease use if you notice irritation.\n\nDon't use with: Avoid using any retinoid at the same time as products with vitamin C, AHAs, or BHAs, as this can up the likelihood of sensitivity and irritation, says Nussbaum. She recommends using the former in the morning (under SPF, of course) and reserving the retinoid for nighttime use."
  },
  {
    "name": "Retinol",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Increases cell turnover, boosts collagen production, and regulates oil production.\n\nWho should use it: In general, anyone looking to reduce the signs of skin aging. Retinol is not recommended for women who are pregnant, planning to be, or nursing. Those with eczema or rosacea that's flaring should not use retinol.\n\nHow often can you use it: Start with twice a week to prevent irritation. Because sunlight deactivates retinol, apply it at night, followed by a moisturizer.\n\nWorks well with: Hydrating cleansers, niacinamide, hyaluronic acid, and ceramides.\n\nDon't use with: Heavy scrubs, astringents, toners, alpha hydroxy acids, beta hydroxy acids, benzoyl peroxide, and vitamin C, as doing so may irritate the skin."
  },
  {
    "name": "Palmitate",
    "facts": "Type of ingredient: Exfoliator.\n\nMain benefits: Promotes skin cell turnover, improves skin tone, helps unclog pores, helps thicken the dermis to slow down the formation of wrinkles.\n\nWho should use it: Because retinyl palmitate is the least irritating of all four retinoids (more on that in a minute), it's a great option for almost all skin types and anyone who wants to keep their pores clear and skin youthful, says Solomon. It does still have the potential to be somewhat irritating for those with extremely sensitive skin, however.\n\nHow often can you use it: While it's important to ease into things to let your skin gradually acclimate to the ingredient, it can ultimately be used daily.\n\nWorks well with: According to Lain, \"Retinoids have a synergistic effect with antioxidants such as vitamins C, E, and ferulic acid.\" Pairing any retinoid with sunscreen is also important since it may make your skin more susceptible to the sun.\n\nDon't use with: Since retinyl palmitate has exfoliating properties, avoid combining it with other chemical exfoliants, such as glycolic or salicylic acid, as well as harsh scrubs with abrasive ingredients, cautions Lain. This holds especially true if you fall into the super sensitive skin camp. It can also cause some dryness, notes Solomon, so it's a good idea to pass on toners and astringents, too."
  },
  {
    "name": "Rosehip Oil",
    "facts": "Hadley king, MD, is a dermatologist in New York City.\n\nJoshua zeichner, MD, is a director of cosmetic and clinical research in dermatology at Mount Sinai Hospital in New York.\n\nMarisa plescia is a cosmetic research scientist at Naked Poppy.\n\nType of ingredient: Oil.\n\nMain benefits: Brightens and evens out the skin, regenerates and heals, helps with anti-aging, elasticity, and collagen production.\n\nWho should use it: In general, rosehip oil is beneficial for all skin types.\n\nHow often can you use it?: It's safe to use twice a day, morning and night.\n\nWorks well with: In general, rosehip oil can be used with most products and ingredients.\n\nDon't use with: Rosehip oil should work well with most ingredients."
  },
  {
    "name": "Rosemary Leaf Extract",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: A potent antioxidant, rosemary leaf extract protects the skin and prevents signs of premature aging. Rosmarinic acid (the main component in rosemary leaf extract) is powerfully calming for skin conditions like eczema and acne.\n\nWho should use it: In general, anyone with acne, eczema or anyone interested in anti-aging skincare.\n\nHow often can you use it: It's safe for daily use.\n\nWorks well with: Rosemary leaf extract plays nice with most skincare ingredients. Having said that, it's always worth looking to expertly-blended formulas from reputable brands and patch testing if you are prone to sensitivity.\n\nDon't use with: Rosemary leaf extract is safe to use in conjunction with most, if not all, ingredients."
  },
  {
    "name": "Royal Jelly",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Increases collagen production, promotes wound healing, fights inflammation.\n\nWho should use it: In general, royal jelly can be used by anyone who isn't pregnant; breastfeeding; or allergic to bees, bee byproducts.\n\nHow often can you use it: Up to twice daily.\n\nWorks well with: \"Since it is not irritating, it can be used in a regimen with potentially more aggressive products, like retinol\" or alpha hydroxy acids, says Loretta Ciraldo, M.D., a board-certified dermatologist based in Miami and the founder of Dr. Loretta skincare.\n\nDon't use with: No skincare ingredients are known to have unsafe interactions with royal jelly."
  },
  {
    "name": "Safflower Oil",
    "facts": "Type of ingredient: Plant-based oil.\n\nMain benefits: Moisturizes the skin and is rich in protective antioxidants. It also has anti-inflammatory effects and helps promote wound healing says Zalka, who adds that it can help reduce the size of blackheads and whiteheads as well.\n\nWho should use it: It's very well-tolerated, so pretty much anyone can use it.\n\nHow often can you use it: You can use safflower oil up to twice a day.\n\nWorks well with: Zalka says it pairs especially well with vitamin C, another potent antioxidant.\n\nDon't use with: There are no known interactions; Walls says it works well with nearly every other skincare ingredient."
  },
  {
    "name": "Salicylic Acid",
    "facts": "Type of ingredient: Exfoliant.\n\nMain benefits: Sloughs off dead skin, removes excess oil, and reduces whiteheads and blackheads.\n\nWho should use it: In general, those who have oily skin and are looking to treat superficial acne, like whiteheads, blackheads, and small red pimples, according to Mudgil.\n\nHow often can you use it: Marmur says salicylic acid should be used in moderation until you know your skin can handle it without irritation. If your skin tolerates it, you can increase the frequency to twice a day, unless you know you'll be getting direct sun exposure, then it should only be applied at night.\n\nWorks well with: Marmur recommends using the acne ingredient along with ingredients that soothe the skin, like Canadian willow herb, and calm any irritation that the salicylic acid could potentially cause.\n\nDon't use with: Although salicylic acid can be combined with other exfoliating ingredients, Mudgil says that in order to avoid irritation, it's best to stick to only one exfoliant at a time."
  },
  {
    "name": "Sea Buckthorn Oil",
    "facts": "Type of ingredient: Hydrator and moisturizer.\n\nMain benefits: Provides hydration, evens out skin tone, and improves the appearance of fine lines and wrinkles.\n\nWho should use it: Most skin types.\n\nHow often can you use it: Once daily.\n\nWorks well with: Most ingredients.\n\nDon't use with: There are no known ingredients that it can't be used with, though you should always pay attention to how a new product interacts with your existing routine."
  },
  {
    "name": "Sea Salt",
    "facts": "Type of ingredient: Salt that contains naturally occurring minerals.\n\nMain benefits: Anecdotally, it's said to have anti-inflammatory and antibacterial properties, though the scientific evidence backing this is limited (and even more so as it pertains to acne-specific benefits), says Chang. It is a natural exfoliant and can be effective for this purpose, so long as it is used properly.\n\nWho should use it: Chang says it can be used by those who have dull, rough, or dry skin. Gohara says it may be somewhat beneficial for those with oily skin and occasional blemishes, though this hinges largely on the caveat that it's used correctly. (More on that in a moment.).\n\nHow often can you use it:  Daily or a few times per week, depending on your skin type and how it's being used.\n\nWorks well with: Light, hydrating ingredients, such as hyaluronic acid, and non-irritating, anti-inflammatory ingredients, such as niacinamide, says Gohara.\n\nDon't use with: Retinoids or salicylic or glycolic acids, which can lead to overdrying of the skin, cautions Gohara."
  },
  {
    "name": "Seaweed",
    "facts": "Type of ingredient: Antioxidant, exfoliant, hydrator, brightener.\n\nMain benefits: Regulates oil production, exfoliates, brightens, and moisturizes dry, dull skin.\n\nWho should use it: Anyone looking for hydrating and exfoliating benefits. Also, those with acne, rosacea, and skin sensitivities will benefit from its healing properties.\n\nHow often can you use it: Seaweed extract can be used at any time.\n\nWorks well with: Seaweed extract is compatible with many ingredients, although it can be used alone. These include Vitamin B3, hyaluronic acid, peptides, and botanical extracts.\n\nDon't use with: There are no specific ingredients known to have a negative interaction with seaweed, but Sarfati notes it's always best to work with your skincare professional or esthetician when creating a full skincare program."
  },
  {
    "name": "Sea Moss",
    "facts": "Type of ingredient: Hydrator and antioxidant.\n\nMain benefits: Hydrates skin, may reduce severity of acne and inflammation.\n\nWho should use it: Any skin type, especially those with acne and dry skin.\n\nHow often can you use it: Seaweed extract is gentle enough to be used every day, but most products recommend using it two to four times a week.\n\nWorks well with: \"Since most of the benefits are attributed to the seaweed's ability to form a film on the skin, I would recommend using this in a moisturizer or serum or any leave on-application,\" says Krupa Koestline, a clean cosmetic chemist and founder of KKT Consultants.\n\nDon't use with: Sea moss would not be as potent when used with a wash-off product, according to Koestline."
  },
  {
    "name": "Shea Butter",
    "facts": "Type of ingredient: Hydrator.\n\nMain benefits: Hydrating, antioxidant, soothes irritation.\n\nWho should use it: In general, anyone with dry skin.\n\nHow often can you use it: As much as you want, if you don't have an allergy.\n\nWorks well with: Other oils, cocoa butter.\n\nDon't use with: There are no ingredients known to interfere with shea butter."
  },
  {
    "name": "Snail Mucin",
    "facts": "Type of ingredient: Moisturizer and collagen-stimulator.\n\nMain benefits: Moisturizes skin, promotes collagen production, aids in skin healing and regeneration.\n\nWho should use it: In general, snail mucin can be used on all skin types, though its hydrating properties make it especially choice for those with dry skin, says Lain. And unless you're allergic to the ingredient, it's generally well-tolerated by most. (Though keep in mind that since it is derived from an animal vegans should take a pass).\n\nHow often can you use it: This largely depends on why you're using it--since it does have many benefits--and what type of product it's found in. Generally speaking, you can use snail mucin once or twice per day.\n\nWorks well with: It's often combined with antioxidants and retinol, as well as common skincare staples such as vitamin C, glycolic acid, and other moisturizing ingredients.\n\nDon't use with: Because research is still limited, it's unknown whether or not it interacts poorly with any other ingredients, says Lain. Right now, there's no evidence that it does."
  },
  {
    "name": "Sodium Ascorbyl Phosphate",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Neutralizes skin-damaging free radicals, boosts collagen production, evens skin tone, has antimicrobial benefits.\n\nWho should use it: In general, because this is less potent than other forms of vitamin C, it's generally safe for all skin types, though some people may experience mild irritation.\n\nHow often can you use it: Once to twice daily, although it's always a good idea to start by using it just a few times per week and gradually increasing the frequency in order to ensure your skin can tolerate it, advises Farber.\n\nWorks well with: Other antioxidants, in particular vitamin E and ferulic acid, as well as hydrating ingredients such as hyaluronic acid.\n\nDon't use with: Benzoyl peroxide can oxidize vitamin C, and retinols work best at a different pH, says Farber. If both of these are a part of your regimen, use them at different times of the day."
  },
  {
    "name": "Sodium Deoxycholate",
    "facts": "Type of ingredient: Solubilizer and detergent.\n\nMain benefits: Breaks apart fat.\n\nWho should use it: In theory, someone who was interested in toning their face might consider trying a product containing sodium deoxycholate. However, the topical benefits are still unclear.\n\nHow often can you use it: Because a lot of information is still unknown, it's best to follow the manufacturer's instructions for application.\n\nWorks well with: Given all the unknowns, Fu and Lu would recommend that if you do want to test sodium deoxycholate out, a great insurance policy would be to add other classic anti-aging ingredients into the mix, like peptides.\n\nDon't use with: Lu explains that since penetration seems to be key when dealing with sodium deoxycholate, it would be best to be on the lookout for high amounts of penetration enhancers, which are ingredients such as propylene glycol, ethoxydiglycol, and butylene glycol. These ingredients work by helping the active ingredients in a product penetrate through the skin and make them more effective, but Lu points out that this process can be irritating for those with sensitive and dry skin types."
  },
  {
    "name": "Sodium Hyaluronate",
    "facts": "Type of ingredient: Humectant.\n\nMain benefits: Improves dryness and reduces wrinkles, replenishes the skin, and provides structure and volume.\n\nHow often can you use it: Sodium hyaluronate is safe to use in concentrations of up to percent twice daily, morning and night.\n\nWorks well with: Moisturizers.\n\nDon't use with: Generally, sodium hyaluronate is safe to use with most, if not all, ingredients."
  },
  {
    "name": "Sodium Hydroxide",
    "facts": "Type of ingredient: pH balancer.\n\nMain benefits: According to Rossi, sodium hydroxide helps maximize the efficacy of certain products, particularly cleansers and leave-on exfoliants, that require the pH to be held within a very specific range.\n\nWho should use it: While there's been ample fear-mongering, both dermatologists agree that it is generally considered safe to use in beauty products. That being said, every person is different. Rossi suggests that anyone who is highly allergic or sensitive spot-test the product first on the forearm.\n\nHow often can you use it: Since sodium hydroxide is used in cosmetics in very low quantities, it can be used daily without irritation.\n\nWorks well with: Since sodium hydroxide is used mainly as a pH balancer, it's a fairly common ingredient in a handful of formulas, according to Rossi. You'll generally find it in very acidic and very alkaline formulas.\n\nDon't use with: Sodium hydroxide works well with most other ingredients. It's not so much about what it's used with as much as how much is used."
  },
  {
    "name": "Sodium Lauroyl Lactylate",
    "facts": "Type of ingredient: Emulsifier and surfactant.\n\nMain benefits: Washes away oil, helps other ingredients absorb into the skin, improves the texture and feel of formulas, and helps to moisturize the skin.\n\nWho should use it: Sodium lauroyl lactylate is generally safe to use unless you are allergic or you know you are sensitive to lactic acid, according to King. That said, King adds that the amount of lactic acid in lactylate should not be a concern. .\n\nHow often can you use it: \"Sodium lauroyl lactylate is a very low-risk ingredient that is safe to use on a daily basis if you do not have a specific allergy to it,\" says Karhade.\n\nWorks well with: Sodium lauroyl lactylate works well with most ingredients, but according to King, there isn't any ingredient, in particular, that will boost its effectiveness or otherwise.\n\nDon't use with: \"There isn't any specific ingredient that you should avoid using in conjunction with sodium lauroyl lactylate. Even though sodium lauroyl lactylate easily penetrates the skin and helps other ingredients absorb, this is generally not a concern unless someone has super-sensitive skin,\" says King."
  },
  {
    "name": "Sodium Lauryl Sulfate",
    "facts": "Type of ingredient: Foaming agent.\n\nMain benefits: Creates a lather, encourages a deep clean, and emulsifies.\n\nWho should use it: Those who don't have an allergy or sensitivity to it.\n\nHow often can you use it: Can be used every day if you only apply it to areas that harbor bacteria and limit the amount of time on your skin.\n\nWorks well with: Moisturizers to counteract the dryness from sodium lauryl sulfate.\n\nDon't use with: Physical and chemical exfoliants, as doing so may further irritate the skin."
  },
  {
    "name": "Sodium Palmate",
    "facts": "Type of ingredient: According to Garshick, sodium palmate is a common base ingredient found in soaps that helps pull dirt and grime away from the skin. .\n\nMain benefits: Not only does it remove oil, dirt, and grime, it acts as an emulsifier so that your products maintain their consistency. .\n\nWho should use it: Garshick explains that sodium palmate can be used by anyone unless they have a known allergy, which is rare. .\n\nHow often can you use it: Hu and Garshick confirm that it can be used daily and even multiple times per day.\n\nWorks well with: It works well with moisturizers since it can be a little drying, so go ahead and slather on your favorite after use. Garshick suggests pairing it with moisturizing ingredients like hyaluronic acid or glycerin. .\n\nDon't use with: It can be paired with most things--just make sure that you're looking out for your skin's moisture barrier with nourishing ingredients."
  },
  {
    "name": "Sodium PCA",
    "facts": "Type of ingredient: Humectant.\n\nMain benefits: Hydrates by attracting water to and trapping it in the skin while also helping to restore the protective skin barrier. It also has anti-inflammatory properties.\n\nWho should use it:  Pretty much anyone and everyone, given that it's both extremely well-tolerated and also has those anti-inflammatory benefits that make it suitable even for those with compromised and/or sensitive skin.\n\nHow often can you use it: Daily or even multiple times per day.\n\nWorks well with: According to Steinmetz, it works well with most ingredients. It's oftentimes paired with other humectants, especially hyaluronic acid.\n\nDon't use with: When combined with nitrosamines such as DEA or TEA, both ingredients may be less effective and can potentially harm the skin, cautions Irwin. Look for these ingredients on the label and avoid them if possible, she says."
  },
  {
    "name": "Sodium Tallowate",
    "facts": "Type of ingredient: Soap.\n\nMain benefits: Dissolves dirt and oil from skin.\n\nWho should use it: According to the experts we spoke with, only those with oily skin should use this ingredient.\n\nHow often can you use it: Sparingly, it can easily over-dry the skin.\n\nWorks well with: It works well with other ingredients commonly found in soap, such as surfactants, dyes, and fragrances.\n\nDon't use with: There are no ingredients known to interact negatively with sodium tallowate, but it does have some side effects."
  },
  {
    "name": "Soybean Oil",
    "facts": "Type of ingredient: Oil.\n\nMain benefits: Improves moisture retention, reinforces moisture barrier, anti-inflammatory.\n\nWho should use it: In general, soybean oil is great for dry and sensitive skin. It is not recommended for oily skin.\n\nHow often can you use it: You can use soybean oil and products containing it twice a day.\n\nWorks well with: Soybean oil works well with emollient and humectant ingredients.\n\nDon't use with: In general, soybean oil works well with most ingredients."
  },
  {
    "name": "Spironolactone",
    "facts": "Type of ingredient: Oral Medication.\n\nMain benefits: Regulates oil production, blocks androgen receptors, and reduces the length of hormonal breakouts.\n\nWho should use it: In general, women with hormonal acne or women who have been resistant to other acne treatments in the past. It is not recommended for men or for women who are looking to become pregnant. You must have a prescription to use Spironolactone.\n\nHow often should you use it? Consult a dermatologist.\n\nWorks well with: Generally, it works well with all topical treatments.\n\nDon't use with: Check with your physician for interactions with other medications."
  },
  {
    "name": "Stearic Acid",
    "facts": "Type of ingredient: Emollient, surfactant, and emulsifier.\n\nMain benefits: Softens and smooths the skin's surface while also helping to maintain the skin barrier. It also works as a surfactant, though it is often used as an emulsifier to thicken products and improve their texture, says Petrillo.\n\nWho should use it: Stearic acid is extremely well-tolerated and something that pretty much anyone can use, though it's an especially great ingredient for those with sensitive, dry skin, points out Madfes.\n\nWhen you can use it: Products containing stearic acid can be tolerated morning or night.\n\nWorks well with: Almost all ingredients, specifically many oils. It's also often paired with more irritating actives to minimize the drying side effects.\n\nDon't use with:  According to Petrillo, there are no specific ingredients that stearic acid doesn't work well with."
  },
  {
    "name": "Stearyl Alcohol",
    "facts": "Type of ingredient: Alcohol.\n\nMain benefits: Acts as an emollient to soften the skin, while also working as an emulsifier to help oil and water combine and give products a smooth consistency, says Hayag.\n\nWho should use it: Stearyl alcohol has a long history of use, as well as numerous research studies proving its safety; all skin types can use it, says Lain.\n\nHow often can you use it: Daily.\n\nWorks well with: It's most often found in products requiring the combination of oils and waters, such as lotions and creams.\n\nDon't use with: There are no known ingredients that will interact poorly with stearyl alcohol."
  },
  {
    "name": "Squalane",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Calms inflammation, supports the outer skin barrier, and works well with actives like retinol.\n\nWho should use it: It is recommended for all skin types.\n\nHow often can you use it: Plant-based squalane is safe to use daily, morning and night.\n\nWorks well with: Actives like BHAs, AHAs, PHAs, and retinols.\n\nDon't use with: Squalane is safe to use with most ingredients."
  },
  {
    "name": "Succinic Acid",
    "facts": "Type of ingredient: Succinic acid is an antimicrobial and anti-inflammatory compound.\n\nMain benefits: Has antimicrobial, anti-inflammatory, and soothing effects. Offers antioxidant protection as well as anti-aging properties, and hydrates.\n\nHow often can you use it: This depends on the particular product, but generally speaking, daily.\n\nWorks well with: It's often paired with hyaluronic acid to boost the hydrating effects, notes Petrillo. It also works well with other anti-acne ingredients, such as salicylic acid and sulfur, adds Curry.\n\nDon't use with: According to Petrillo, there are no ingredients known to have a negative interaction with succinic acid."
  },
  {
    "name": "Sulfates",
    "facts": "Michele farber, MD, is a New York City-based dermatologist at Schweiger Dermatology Group.\n\nY. claire chang, MD, is a board-certified cosmetic dermatologist at Union Derm in New York City.\n\nMichelle cleveland is a hairstylist and the owner of Hair Addict Salon.\n\nKevin ewell is a cosmetic chemist. he is based in los angeles.\n\nType of ingredient: Cleanser.\n\nMain benefits: Remove oil/dirt/product from hair and create lather in shampoo.\n\nWho should use it: Those with greasy hair or heavy build-up.\n\nHow often can you use it: Daily.\n\nWorks well with: Moisturizing oils like coconut oil and argan oil.\n\nDon't use with: Deep cleansers like charcoal since the combination may be too harsh on hair."
  },
  {
    "name": "Sulfur",
    "facts": "Type of ingredient: Exfoliant.\n\nMain benefits: Kills bacteria, reduces sebum, and sloughs away dead skin.\n\nWho should use it: Sulfur can be used to treat those with mild-to-moderate acne, rosacea, seborrheic dermatitis, psoriasis, and eczema.\n\nHow often can you use it: According to Shah, it can be used on a daily basis, and some skin types can tolerate some formulations (such as a wash) even twice a day.\n\nWorks well with: Sodium sulfacetamide. \"There are newer formulations of topical sulfur lotions that are combined with sodium sulfacetamide, creating a more gentle and less stinky product,\" Cheung says.\n\nDon't use with: Cheung says to avoid combining sulfur with other topicals that dry out the skin or exfoliate (such as retinoids, benzoyl peroxide, and salicylic acid) to prevent the skin from becoming too dry or inflamed."
  },
  {
    "name": "Sunflower Oil",
    "facts": "Type of ingredient: Carrier oil.\n\nMain benefits: Soothes skin, strengthens the skin barrier, hydrates.\n\nWho should use it: If your complexion is on the thirsty side, sunflower oil delivers the hydration your skin craves.\n\nHow often can you use it: It can be used daily.  .\n\nWorks well with: In general, sunflower oil plays well with others.\n\nDon't use with: There aren't any specific ingredients you should avoid using with sunflower oil.\n\n "
  },
  {
    "name": "Synthetic Beeswax",
    "facts": "Type of ingredient:  Occlusive.\n\nMain benefits: Helps keep skin moisturized by creating a barrier to minimize the amount of trans-epidermal water loss. It's also largely used for formulation purposes; it lends a creamy texture to beauty products such as lip balms and mascaras, says Yadav.\n\nWho should use it: It's universally beneficial, though it is an especially good option for those in search of vegan beauty products (though keep reading for one caveat on that point).\n\nHow often can you use it: Daily.\n\nWorks well with: Synthetic beeswax works well with all oils and oil-soluble ingredients, explains King. And, \"because it's relatively inert in purified cosmetic-grade forms, it can be combined with lots of different biologically active ingredients, such as vitamin E, to help provide a medium for their activity,\" adds Yadav.\n\nDon't use with: According to King, it doesn't work well with any water-soluble ingredients, such as herbal or flower extracts, unless an emulsifier is used. (Although this is typically more of a formulation concern; there are no ingredients that are known to interact negatively with synthetic beeswax from a topical use perspective.)."
  },
  {
    "name": "Tamanu Oil",
    "facts": "Type of ingredient: Emollient.\n\nMain benefits: Moisturization, antioxidant production, and an anti-inflammatory effect. It also stimulates collagen production to promote wound healing and has some antibacterial properties, particularly against the bacteria associated with acne, notes Petrillo.\n\nWho should use it: Those with dry skin, as well as those with minor acne and scarring, or people looking for an oil with anti-aging benefits.\n\nHow often can you use it: This depends on the particular product you're using, but generally it can be used once or twice per day.\n\nWorks well with: According to Gonzalez, it's often combined with other popular skincare oils--rosehip, cranberry seed, avocado--when formulated in serums or lotions.\n\nDon't use with: There are currently no ingredients known to have a negative interaction with tamanu oil. Gonzalez does note that if you're using a pure version of tamanu oil on your face, there's simply no need to apply other oils as well."
  },
  {
    "name": "Tea Tree Oil",
    "facts": "Type of ingredient: Essential oil.\n\nMain benefits: Kills bacteria, fungus, and eases inflammation.\n\nWho should use it: Those with acne-prone skin and fungal skin conditions, such as atopic dermatitis.\n\nHow often can you use it: According to Chang, tea tree oil should be applied twice daily for six to 12 weeks to start seeing a benefit. However, do not apply it directly to the skin--it should be diluted with a carrier oil, such as jojoba oil.\n\nWorks well with: Non-comedogenic carrier oils.\n\nDon't use with: Any other active product (benzoyl peroxide, salicylic acid, retinol, etc.)."
  },
  {
    "name": "Tepezcohuite",
    "facts": "Type of ingredient: Anti-microbial.\n\nMain benefits: Moisturizes, and could potentially promote burn- and wound-healing.\n\nWho should use it: In general, anyone with dry or irritated skin.\n\nHow often can you use it: Not enough scientific studies have been conducted to determine appropriate usage.\n\nWorks well with: Aloe and tea tree oil.\n\nDon't use with: Harsh exfoliators such as glycolic acid, and astringents, as doing so may irritate the skin."
  },
  {
    "name": "Tranexamic Acid",
    "facts": "Type of ingredient: Acid.\n\nMain benefits: Fades discoloration, brightens skin, reduces the appearance of acne scars.\n\nWho should use it: Generally, tranexamic acid is safe for all skin types. Those with super sensitive skin or eczema should do a test on the inside of the wrist before use, just to be safe.\n\nHow often you can use it: Ideally, tranexamic acid-containing products would be applied twice a day, but some suggest starting with one application per day to see how it reacts with your skin.\n\nWorks well with: Vitamin C, SPF, hyaluronic acid, retinol.\n\nDon't use with: Multiple different acids, stick to a combination of one or two additional acid products to avoid dryness."
  },
  {
    "name": "Tretinoin",
    "facts": "Type of ingredient: retinoid.\n\nMain benefits: treats acne; minimizes and prevents fine lines and wrinkles; evens out skin tone.\n\nWho should use it: in general, anyone with acne-prone skin or aging concerns; tretinoin is not recommended for pregnant people or those with rosacea.\n\nHow often can you use it: Tretinoin can be used up to once per day depending on skin sensitivity and should be applied at night.\n\nWorks well with: moisturizers.\n\nDon't use with: other exfoliators such as benzoyl peroxide, glycolic acid, and astringents, which may result in dryness and irritation."
  },
  {
    "name": "Triethanolamine",
    "facts": "Type of ingredient: Emulsifier and pH adjuster.\n\nMain benefits: Stabilizes, balances a product's pH, and thickens the formula.\n\nWho should use it: In general, anyone who does not have an allergy to it.\n\nHow often can you use it: As long as it's delivered from a standard cosmetic product and does not cause irritation, products with triethanolamine are considered safe to use daily by both Romanowski and Schultz.\n\nWorks well with: As a pH adjuster, triethanolamine works particularly well with acidic materials.\n\nDon't use with: According to reviews by the Cosmetic Ingredient Review Expert Panel, to prevent the formation of possibly carcinogenic nitrosamines, triethanolamine should not be used with N-nitrosating agents in formulations or should not be used in cosmetic products in which N-nitroso compounds can be formed."
  },
  {
    "name": "Turmeric",
    "facts": "Adarsh vijay mudgil, md, is a dermatologist and founder of Mudgil Dermatology in NYC.\n\nMichelle wong is a cosmetic chemist and the science educator and content creator behind LabMuffin.\n\nAimee paik, md, is a dermatologist of Apostrophe.\n\nType of ingredient: Anti-inflammatory.\n\nMain benefits: Diminishes fine lines and wrinkles, treats acne, and brightens skin.\n\nWho should use it: In general, people with inflammation, acne, and/or oily skin.\n\nHow often can you use it: At max once a day, lest you start to stain your skin. If you're using Kasturi turmeric, as much as you want.\n\nWorks well with: Honey, apple cider vinegar, gram flour, milk, and anything else you use in at-home masks.\n\nDon't use with: Lime--the two used together are a common homemade treatment for skin lightening."
  },
  {
    "name": "Undecylenic Acid",
    "facts": "Type of ingredient: Anti-fungal.\n\nMain benefits: Prevents and eliminates topical fungus.\n\nWho should use it: Individuals with diagnosed fungal skin infections can benefit from using an anti-fungal topical treatment containing undecylenic acid, says Rabach.\n\nHow often can you use it: Most over-the-counter products can be applied twice daily.\n\nWorks well with: It works well with and is often formulated with zinc. This combination provides a soothing and healing environment for the skin, which can become irritated from a fungal infection, says Greenfield. Rabach adds that combining undecylenic acid with zinc may also help minimize the potentially irritating side effects that the ingredient might cause.\n\nDon't use with: According to Rabach, there's no data showing that it's problematic to use it with any other ingredients."
  },
  {
    "name": "Urea 40",
    "facts": "Type of ingredient: Keratolytic emollient (tissue softener).\n\nMain benefits: Dissolves the intracellular matrix, which loosens dead, scaly skin. This makes it ideal for treating calluses, dermatitis, psoriasis, eczema, and keratosis pilaris. It also draws moisture into the skin for serious hydration.\n\nWho should use it: Anyone with dehydrated, flaky/scaly skin or who has one of the above skin conditions.\n\nHow often can you use it: Generally, you should apply to the affected areas one to three times a day (or as directed by your physician). Unless the treatment area is on the hands, remember to wash them immediately after using the product to not inadvertently treat the skin on the hands.\n\nWorks well with: Products with Urea 40 should be used alone.\n\nDon't use with: Products with Urea 40 should be used alone."
  },
  {
    "name": "Vegetable Glycerin",
    "facts": "Type of ingredient: Humectant.\n\nWho should use it: Anyone and everyone, though it's especially great for those prone to dry skin.\n\nMain benefits: Attracts water to and holds in the skin, leaving it feeling and looking smooth and supple.\n\nHow often can you use it: Daily or even multiple times per day.\n\nWorks well with: Vegetable glycerin works well with most ingredients, says Steinmetz, who points out that its silky, liquid texture has the added benefit of lending a nice consistency to many formulas. Greenfield adds that, because of its humectant properties, it can also be used before and after more potentially irritating ingredients, such as retinoids, that tend to dry out the skin.\n\nDon't use with: According to the experts we spoke with, there are no ingredients known to interact negatively with vegetable glycerin."
  },
  {
    "name": "Vitamin A",
    "facts": "Type of ingredient: Retinoid.\n\nMain benefits: Stimulates the production of collagen to reduce fine lines and wrinkles, stimulates cell turnover, decreases oil production, has an anti-inflammatory effect.\n\nWho should use it: According to Gmyrek, everyone starting in their mid-20s (and even earlier if you're battling acne), except for women who are pregnant or breastfeeding. Depending on the formulation, vitamin A can potentially be too irritating for those with sensitive skin.\n\nHow often can you use it: Daily, or more specifically, nightly, once your skin has acclimated to the ingredient.\n\nWorks well with: Always pair vitamin A with sunscreen, as it can make your skin more sensitive to the sun. Many formulas incorporate soothing ingredients such as chamomile, or hydrating ingredients such as hyaluronic acid with vitamin A, to help increase the tolerability of a product, says Petrillo.\n\nDon't use with: Alpha-hydroxy acids, such as glycolic acid, complement vitamin A's anti-aging effects nicely, though using the two in tandem can increase the likelihood of irritation so proceed with caution, says Gmyrek."
  },
  {
    "name": "Niacinamide",
    "facts": "Type of ingredient: Brightener.\n\nMain benefits: Brightening, prevents signs of aging, reduces acne.\n\nWho should use it: In general, anyone who wants their skin to be bright or prevent aging.\n\nHow often can you use it?: You can use it in both morning and evening.\n\nWorks well with: \"When using vitamin B3, it is good to combine it with other stable and powerful antioxidants, such as camellia sinensis (green tea) catechins, quercetin, and tocopherol,\" says Mun. It may also ease irritation related to retinol and skin redness generally.\n\nDoesn't work with: Vitamin B3 works well with everything."
  },
  {
    "name": "Vitamin C",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Protects against free radical damage, evens skin tone, and promotes collagen production.\n\nWho should use it: Vitamin C is not recommended for those with extremely sensitive skin and can be problematic for those with oily skin. Herrmann recommends asking your board-certified dermatologist which brand may be best suited for your skin type. .\n\nHow often can you use it: Herrmann recommends using vitamin C daily or every other day.\n\nWorks well with: Vitamin C works well with complementing antioxidants like vitamin E and ferulic acid, which will boost the efficacy and stability of the molecule.\n\nDon't use with: Avoid using with benzoyl peroxide, which can oxidize the vitamin C and make it useless very quickly. Also avoid using vitamin C with other acids, which may cause excessive skin irritation, especially if used daily. And lastly, don't use with retinol, which can make the vitamin C more unstable and less likely to penetrate the skin."
  },
  {
    "name": "Vitamin D",
    "facts": "Type of ingredient: Vitamin.\n\nMain benefits: Calms inflammation, protects the skin, and improves cell turnover.\n\nWho should use it: Someone who is deficient should take a vitamin D supplement. Those looking to fight inflammatory skin diseases can consider a prescription topical.\n\nHow often can you use it: According to the National Institutes of Health, the average, non-deficient adult should aim for 600 International Units (IU) per day in their diet. As far as topically, Zeichner says there is no harm in using a vitamin D cream daily.\n\nWorks well with: When treating psoriasis, Gerstner says topical vitamin D is often used in conjunction with a topical steroid. If using topical vitamin D for anti-aging, Herrmann recommends combining it with other antioxidant vitamins, growth factors, or retinoids.\n\nDon't use with: Zeichner says topical vitamin D cannot be combined with hydroxy acids, like glycolic or salicylic acid, because the acidic pH inactivates vitamin D. ."
  },
  {
    "name": "Vitamin E",
    "facts": "Type of ingredient: Barrier booster.\n\nMain benefits: Seals in moisture, smooths skin, antioxidant.\n\nWho should use it: In general, anyone with dry skin. Vitamin E is not recommended for sensitive skin.\n\nHow often can you use it?: You should only use Vitamin E once a day maximum, preferably at night, as it is usually too thick to put under makeup.\n\nWorks well with: Vitamin C and Ferulic acid.\n\nDon't use with: Retinol/Vitamin A."
  },
  {
    "name": "Vitamin F",
    "facts": "David petrillo is a cosmetic chemist and founder of Perfect Image skincare. .\n\nAnnie gonzalez, MD, and Stacy Chimento, MD, are dermatologists at Miami's Riverchase Dermatology.\n\nType of ingredient: Vitamin, fatty acid.\n\nMain benefits: Hydrates, replenishes, is high in antioxidants, is anti-inflammatory, restores the skin's barrier.\n\nWho should use it: In general, all skin types would benefit from vitamin F usage, but especially those with acneic skin.\n\nHow often can you use it?: Vitamin F is safe to use twice a day, morning and night.\n\nWorks well with: Hydrators, linoleic acid, anti-aging products, and SPF products.\n\nDon't use with: In general, vitamin F can be used with all ingredients safely."
  },
  {
    "name": "Vitamin K",
    "facts": "Type of ingredient: Potential antioxidant and anti-inflammatory, with known effects to help with blood clotting.\n\nMain benefits: Promotes cellular metabolism and has anti-inflammatory properties, promotes wound healing by increasing wound contraction and re-epithelialization, and may have some antioxidant properties. Its role in blood-clotting may also make it beneficial for helping to minimize dark under-eye circles.\n\nWho should use it: Given that in topical preparations it's most often found in creams targeting dark circles, it's most worth a try for those who want to brighten the under-eye area.\n\nHow often can you use it: Topical vitamin K can be used once or twice daily, says Chang.\n\nWorks well with: When used topically it pairs well with arnica, vitamin C, vitamin E, caffeine, as well as retinol, which can help the skin better absorb the vitamin K, says Russak.\n\nDon't use with:  There are currently no specific ingredients known to have a negative interaction with topical vitamin K."
  },
  {
    "name": "Volcanic Ash",
    "facts": "Type of ingredient: Antioxidant.\n\nMain benefits: Clarifying, antibacterial, reduces oxidation.\n\nWho should use it: In general, people with acneic, oily skin.\n\nHow often can you use it?: Try not to use it more than once every few days, as it can be drying.\n\nWorks well with: Hydrating ingredients like hyaluronic acid.\n\nDoesn't work with: Not recommended for use with other exfoliants, as it can be stripping."
  },
  {
    "name": "Willow Bark Extract",
    "facts": "Type of ingredient: Plant extract.\n\nMain benefits: Gently exfoliates, calms redness, reduces oiliness and signs of aging.\n\nWho should use it: Levin says, in general, willow bark extract is gentle, low-risk, and can even be used on sensitive skin.\n\nHow often can you use it: Levin says the daily use of willow bark extract is appropriate.\n\nWorks well with: As an exfoliating ingredient, willow bark extract can be slightly drying, so Petrillo suggests always following up with a good moisturizer. To boost the exfoliating and skin-cleansing benefits of willow bark extract, Petrillo recommends using products with salicylic acid, too.\n\nDon't use with: \"Willow bark is commonly used in cleansers and toners,\" Petrillo explains. \"As long as none of the products you use contain active ingredients that don't work with salicylic acid, then it is safe.\" A few examples of ingredients that Petrillo doesn't recommend mixing with salicylic acid are retinol and vitamin C."
  },
  {
    "name": "Xanthan Gum",
    "facts": "Type of ingredient: Thickener and emulsifying agent.\n\nMain benefits: While it's mainly used for formulation purposes, xanthan gum might have some skin conditioning properties because it is a polysaccharide, or sugar molecule.\n\nWho should use it: According to our experts, it's not necessarily an ingredient anyone needs to seek out nor avoid necessarily. Mostly, it's formulators who are using it, not consumers.\n\nWorks well with: It works well with almost all ingredients.\n\nDon't use with: There are no ingredients known to interact with xanthan gum negatively."
  },
  {
    "name": "Zinc",
    "facts": "Type of ingredient: Anti-acneic.\n\nMain benefits: Anti-inflammatory, antibacterial, regulates oil.\n\nWhen you can use it: You can generally take it once a day. You should have no more than 40mg max.\n\nWorks well with: Zinc can be taken with a range of other supplements and vitamins, including Vitamin C and vitamin B5. As always, consult your doctor before starting any new supplements.\n\nDon't use with: Multivitamins, other sources of zinc that might overload you."
  }
]